Repository: tarantool/cartridge
Catalog: rst/locale/*/LC_MESSAGES/cartridge_dev.po
Languages: ru

source: -- auth.lua -- Add a function to check the credentials local function check_password(username, password) -- Check the credentials any way you like -- Return an authentication success or failure if not ok then return false end return true end ...
ru: -- auth.lua -- Добавьте функцию для проверки учетных данных local function check_password(username, password) -- Проверьте учетные данные любым удобным вам способом -- Верните значение, означающее успех или неудачу аутентификации if not ok then return false end return true end ...

source: Pass the implemented ``auth`` module name as a parameter to ``cartridge.cfg()``, so the cluster can use it:
ru: Передайте имя используемого модуля ``auth`` в качестве параметра для ``cartridge.cfg()``, чтобы кластер мог использовать его:

source: -- init.lua local ok, err = cartridge.cfg({ auth_backend_name = 'auth', -- The cluster will automatically call 'require()' on the 'auth' module. ... })
ru: -- init.lua local ok, err = cartridge.cfg({ auth_backend_name = 'auth', -- Кластер автоматически вызовет 'require()' для модуля 'auth'. ... })

source: This adds a **Log in** button to the upper right corner of the web interface but still lets the unsigned users interact with the interface. This is convenient for testing.
ru: Это добавит кнопку **Log in** (Войти) в верхний правый угол в веб-интерфейсе, но все же позволит неавторизованным пользователям взаимодействовать с интерфейсом, что удобно для тестирования.

source: Also, to authorize requests to cluster API, you can use the HTTP basic authorization header.
ru: Кроме того, для авторизации запросов к API кластера можно использовать базовый заголовок HTTP для авторизации.

source: To require the authorization of every user in the web interface even before the cluster bootstrap, add the following line:
ru: Чтобы требовать авторизацию каждого пользователя в веб-интерфейсе даже до начальной загрузки кластера, добавьте следующую строку:

source: With the authentication enabled and the ``auth`` module implemented, the user will not be able to even bootstrap the cluster without logging in. After the successful login and bootstrap, the authentication can be enabled and disabled cluster-wide in the web interface and the ``auth_enabled`` parameter is ignored.
ru: С включенной аутентификацией при использовании модуля ``auth`` пользователь не сможет даже загрузить кластер без входа в систему. После успешного входа в систему и начальной загрузки можно включить и отключить аутентификацию для всего кластера в веб-интерфейсе, а параметр ``auth_enabled`` игнорируется.

source: Application versioning
ru: Управление версиями приложения

source: Tarantool Cartridge understands semantic versioning as described at `semver.org <https://semver.org>`_. When developing an application, create new Git branches and tag them appropriately. These tags are used to calculate version increments for subsequent packing.
ru: В Tarantool Cartridge используется семантический подход к управлению версиями, как описано на сайте `semver.org <https://semver.org>`_. При разработке приложения создайте новые ветки Git и проставьте соответствующие теги. Эти теги будут использоваться для расчета увеличения версий при последующей упаковке.

source: For example, if your application has version 1.2.1, tag your current branch with ``1.2.1`` (annotated or not).
ru: Например, если версия вашего приложения -- 1.2.1, пометьте текущую ветку тегом ``1.2.1`` (с аннотациями или без них).

source: To retrieve the current version from Git, run:
ru: Чтобы получить идентификатор текущей версии из Git, выполните команду:

source: This output shows that we are 12 commits after the version 1.2.1. If we are to package the application at this point, it will have a full version of ``1.2.1-12`` and its package will be named ``<app_name>-1.2.1-12.rpm``.
ru: Вывод показывает, что после версии 1.2.1 было 12 коммитов. Если мы соберемся упаковать приложение на данном этапе, его полная версия будет ``1.2.1-12``, а пакет будет называться ``<имя_приложения>-1.2.1-12.rpm``.

source: Non-semantic tags are prohibited. You will not be able to create a package from a branch with the latest tag being non-semantic.
ru: Запрещается использовать не семантические теги. Вы не сможете создать пакет из ветки, если последний тег не будет семантическим.

source: Once you :ref:`package <cartridge-deploy>` your application, the version is saved in a ``VERSION`` file in the package root.
ru: После :ref:`упаковки <cartridge-deploy>` приложения его версия сохраняется в файл ``VERSION`` в корневой каталог пакета.

source: Using .cartridge.ignore files
ru: Использование файлов .cartridge.ignore

source: You can add a ``.cartridge.ignore`` file to your application repository to exclude particular files and/or directories from package builds.
ru: В репозиторий приложения можно добавить файл ``.cartridge.ignore``, чтобы исключить определенные файлы и/или каталоги из сборки пакета.

source: For the most part, the logic is similar to that of ``.gitignore`` files. The major difference is that in ``.cartridge.ignore`` files the order of exceptions relative to the rest of the templates does not matter, while in ``.gitignore`` files the order does matter.
ru: По большей части логика похожа на логику файлов ``.gitignore``. Основное отличие состоит в том, что в файлах ``.cartridge.ignore`` порядок исключения относительно остальных шаблонов не имеет значения, а в файлах ``.gitignore`` — имеет.

source: **.cartridge.ignore** entry
ru: запись **.cartridge.ignore**

source: ignores every...
ru: игнорирует все...

source: **folder** (due to the trailing ``/``) named ``target``, recursively
ru: **папки** (поскольку в конце стоит ``/``) под названием ``target`` рекурсивно

source: **file or folder** named ``target``, recursively
ru: **файлы или папки** под названием ``target`` рекурсивно

source: **file or folder** named ``target`` in the top-most directory (due to the leading ``/``)
ru: **файлы или папки** под названием ``target`` в самом верхнем каталоге (поскольку в начале стоит ``/``)

source: **folder** named ``target`` in the top-most directory (leading and trailing ``/``)
ru: **папки** под названием ``target`` в самом верхнем каталоге (в начале и в конце стоит ``/``)

source: every **file or folder** ending with ``.class``, recursively
ru: **файлы или папки**, оканчивающиеся на ``.class``, рекурсивно

source: nothing, this is a comment (the first character is a ``#``)
ru: ничего, это комментарий (первый символ -- ``#``)

source: every **file or folder** with name ``#comment`` (``\`` for escaping)
ru: **файлы или папки** под названием ``#comment`` (``\\`` для выделения)

source: every **folder** named ``logs`` which is a subdirectory of a folder named ``target``
ru: **папки** под названием ``logs``, которые представляют собой подкаталог папки под названием ``target``

source: every **folder** named ``logs`` two levels under a folder named ``target`` (``*`` doesn’t include ``/``)
ru: **папки** под названием ``logs`` на два уровня ниже папки под названием ``target`` (``*`` не включает ``/``)

source: every **folder** named ``logs`` somewhere under a folder named ``target`` (``**`` includes ``/``)
ru: **папки** под названием ``logs`` где угодно в пределах папки ``target`` (``**`` включает ``/``)

source: every **file or folder** ending in ``.pyc`` or ``.pyo``; however, it doesn’t match ``.py!``
ru: **файлы или папки**, оканчивающиеся на ``.pyc`` или ``.pyo``, но не на ``.py!``

source: every **file or folder** ending in anything other than ``c`` or ``o``
ru: **файлы или папки**, оканчивающиеся на что угодно, кроме ``c`` или ``o``

source: every **file or folder** ending in digit
ru: **файлы или папки**, оканчивающиеся на цифру

source: every **file or folder** ending in anything other than digit
ru: **файлы или папки**, оканчивающиеся на что угодно, кроме цифры

source: **every**
ru: **всё**

source: **everything** in the top-most directory (due to the leading ``/``)
ru: **всё** в самом верхнем каталоге (поскольку в начале стоит ``/``)

source: every ``*.tar.gz`` file or folder which is **one or more** levels under the starting folder
ru: файлы ``*.tar.gz`` или папки, которые находятся на **один или несколько** уровней ниже исходной папки

source: every **file or folder** will be ignored even if it matches other patterns
ru: **файлы и папки** будут проигнорированы, даже если они подходят под другие типы

source: Failover architecture
ru: Отказоустойчивая архитектура

source: An important concept in cluster topology is appointing **a leader**. Leader is an instance which is responsible for performing key operations. To keep things simple, you can think of a leader as of the only writable master. Every replica set has its own leader, and there's usually not more than one.
ru: Важную роль в кластерной топологии играет назначение **лидера**. Лидер — это экземпляр, который отвечает за выполнение ключевых операций. Чтобы не усложнять, можно сказать, что лидер — это единственный мастер, доступный для записи. Для каждого набора реплик есть свой лидер — и обычно не больше одного.

source: Which instance will become a leader depends on topology settings and failover configuration.
ru: Назначение экземпляра лидером происходит в зависимости от настроек топологии и конфигурации восстановления после отказа.

source: An important topology parameter is the **failover priority** within a replica set. This is an ordered list of instances. By default, the first instance in the list becomes a leader, but with the failover enabled it may be changed automatically if the first one is malfunctioning.
ru: Важный параметр топологии — **приоритет восстановления после отказа** в пределах набора реплик, который представляет собой упорядоченный список экземпляров. По умолчанию первый экземпляр в списке становится лидером, но если включено восстановление после отказа, лидер может меняться автоматически, когда первый экземпляр не работает.

source: Instance configuration upon a leader change
ru: Конфигурация экземпляра при смене лидера

source: When Cartridge configures roles, it takes into account the **leadership map** (consolidated in the ``failover.lua`` module). The leadership map is composed when the instance enters the ``ConfiguringRoles`` state for the first time. Later the map is updated according to the failover mode.
ru: Когда Cartridge настраивает роли, он учитывает **ассоциативный массив лидеров** (консолидированный в модуле ``failover.lua``). Ассоциативный массив лидеров составляется, когда экземпляр впервые входит в состояние ``ConfiguringRoles``. В дальнейшем массив обновляется в соответствии с режимом восстановления после отказа.

source: Every change in the leadership map is accompanied by instance re-configuration. When the map changes, Cartridge updates the ``read_only`` setting and calls the ``apply_config`` callback for every role. It also specifies the ``is_master`` flag (which actually means ``is_leader``, but hasn't been renamed yet due to historical reasons).
ru: Каждое изменение в ассоциативном массиве лидеров сопровождается переконфигурацией экземпляра. Когда массив меняется, Cartridge обновляет параметр ``read_only`` и вызывает ``apply_config`` для каждой роли. Он также устанавливает флаг ``is_master`` (который на самом деле означает ``is_leader``, но еще не переименован в силу исторических причин).

source: It's important to say that we discuss a *distributed* system where every instance has its own opinion. Even if all opinions coincide, there still may be races between instances, and you (as an application developer) should take them into account when designing roles and their interaction.
ru: Важно отметить, что речь идет о *распределенной* системе, где у каждого экземпляра есть свое собственное мнение. Даже если все мнения совпадают, экземпляры все равно могут быть в состоянии гонки, и вам (как разработчику приложения) следует учитывать их при проектировании ролей и их взаимодействия.

source: Leader appointment rules
ru: Правила назначения лидера

source: The logic behind leader election depends on the **failover mode**: disabled, eventual, or stateful.
ru: Логика выбора лидера зависит от **режима восстановления после отказа**: disabled, eventual или stateful.

source: Disabled mode
ru: Режим disabled

source: This is the simplest case. The leader is always the first instance in the failover priority. No automatic switching is performed. When it's dead, it's dead.
ru: Это самый простой случай. Лидером всегда будет первый экземпляр в приоритете восстановления после отказа. Автоматического переключения не будет. Если он отключен, он отключен.

source: Eventual failover
ru: Режим eventual

source: In the ``eventual`` mode, the leader isn't elected consistently. Instead, every instance in the cluster thinks that the leader is the first **healthy** instance in the failover priority list, while instance health is determined according to the membership status (the SWIM protocol).
ru: В режиме ``eventual`` лидер не выбирается последовательно. Вместо этого каждый экземпляр в кластере считает, что лидером является первый **рабочий** экземпляр в списке приоритетов восстановления после отказа, а работоспособность экземпляра определяется в соответствии со статусом членства (протокол SWIM).

source: The member is considered healthy if both are true:
ru: Член кластера считается рабочим, если выполняются оба условия:

source: It reports either ``ConfiguringRoles`` or ``RolesConfigured`` state;
ru: Он сообщает, что находится в статусе ``ConfiguringRoles`` или ``RolesConfigured``;

source: Its SWIM status is either ``alive`` or ``suspect``.
ru: Его статус по протоколу SWIM: ``alive`` или ``suspect``.

source: A ``suspect`` member becomes ``dead`` after the ``failover_timout`` expires.
ru: Член кластера в статусе ``suspect`` становится недоступным (в статусе ``dead``) по истечении ``failover_timout``.

source: Leader election is done as follows. Suppose there are two replica sets in the cluster:
ru: Выбор лидера осуществляется следующим образом. Предположим, что в кластере есть два набора реплик:

source: a single router "R",
ru: один роутер "R",

source: two storages, "S1" and "S2".
ru: два хранилища: "S1" и "S2".

source: Then we can say: all the three instances (R, S1, S2) agree that S1 is the leader.
ru: Тогда можно сказать, что все три экземпляра (R, S1, S2) согласны с тем, что S1 является лидером.

source: The SWIM protocol guarantees that *eventually* all instances will find a common ground, but it's not guaranteed for every intermediate moment of time. So we may get a conflict.
ru: Протокол SWIM гарантирует, что *постепенно* все экземпляры договорятся, но это не гарантировано в промежуточные моменты времени. Поэтому может возникнуть конфликт.

source: For example, soon after S1 goes down, R is already informed and thinks that S2 is the leader, but S2 hasn't received the gossip yet and still thinks he's not. This is a conflict.
ru: Например, вскоре после того, как упал экземпляр S1, экземпляр R уже получил информацию и думает, что S2 — лидер, но S2 еще не получил это сообщение и еще не считает себя лидером. Вот и конфликт.

source: Similarly, when S1 recovers and takes the leadership, S2 may be unaware of that yet. So, both S1 and S2 consider themselves as leaders.
ru: Аналогично, когда S1 вернется в работу и вновь станет лидером, S2 может не сразу знать об этом. Таким образом, и S1, и S2 будут считать себя лидерами.

source: Moreover, SWIM protocol isn't perfect and still can produce false-negative gossips (announce the instance is dead when it's not).
ru: Более того, протокол SWIM не совершенен и все еще может передавать ложные сообщения (объявлять, что экземпляр недоступен, когда это не так).

source: Stateful failover
ru: Режим stateful

source: Similarly to the eventual mode, every instance composes its own leadership map, but now the map is fetched from an **external state provider** (that's why this failover mode called "stateful"). Nowadays there are two state providers supported -- ``etcd`` and ``stateboard`` (standalone Tarantool instance). State provider serves as a domain-specific key-value storage (simply ``replicaset_uuid -> leader_uuid``) and a locking mechanism.
ru: Как и в режиме eventual, каждый экземпляр составляет свой собственный ассоциативный массив лидеров, но теперь массив берется из **внешнего поставщика состояния** (поэтому этот режим восстановления после отказа называется "с проверкой состояния"). Сейчас поддерживаются два поставщика состояния: ``etcd`` и ``stateboard`` (изолированный экземпляр Tarantool). Поставщик состояния выступает в качестве хранилища пар ключ-значение (просто ``replicaset_uuid -> leader_uuid``) и механизма блокировки.

source: Changes in the leadership map are obtained from the state provider with the `long polling technique <https://en.wikipedia.org/wiki/Push_technology#Long_polling>`_.
ru: Изменения массива лидеров передаются от поставщика состояния с помощью `метода длинных опросов <https://en.wikipedia.org/wiki/Push_technology#Long_polling>`_.

source: All decisions are made by **the coordinator** -- the one that holds the lock. The coordinator is implemented as a built-in Cartridge role. There may be many instances with the coordinator role enabled, but only one of them can acquire the lock at the same time. We call this coordinator the "active" one.
ru: Все решения принимает **координатор** — тот, кто захватил блокировку. Координатор реализован как встроенная роль Cartridge. У множества экземпляров может быть включена роль координатора, но только один из них может захватить блокировку. Этот координатор называется "активным".

source: The lock is released automatically when the TCP connection is closed, or it may expire if the coordinator becomes unresponsive (in ``stateboard`` it's set by the stateboard's ``--lock_delay`` option, for ``etcd`` it's a part of clusterwide configuration), so the coordinator renews the lock from time to time in order to be considered alive.
ru: Блокировка снимается автоматически при закрытии TCP-соединения, или же она может отключиться, если координатор перестанет отвечать (в ``stateboard`` это задается опцией ``--lock_delay``, в ``etcd`` это часть конфигурации на уровне кластера), поэтому координатор время от времени обновляет блокировку, чтобы считаться рабочим.

source: The coordinator makes a decision based on the SWIM data, but the decision algorithm is slightly different from that in case of eventual failover:
ru: Координатор принимает решение на основе SWIM-данных, но алгоритм принятия решения немного отличается от алгоритма в режиме eventual:

source: Right after acquiring the lock from the state provider, the coordinator fetches the leadership map.
ru: Сразу после получения блокировки от поставщика состояния, координатор считывает массив лидеров.

source: If there is no leader appointed for the replica set, the coordinator appoints the first leader according to the failover priority, regardless of the SWIM status.
ru: Если у набора реплик нет лидера, координатор назначает первого лидера в соответствии с приоритетом восстановления после отказа, независимо от статуса SWIM.

source: If a leader becomes ``dead``, the coordinator makes a decision. A new leader is the first healthy instance from the failover priority list. If an old leader recovers, no leader change is made until the current leader down. Changing failover priority doesn't affect this.
ru: Если лидер находится в статусе ``dead``, координатор будет принимать решение. Новым лидером станет первый рабочий экземпляр из списка приоритетов восстановления после отказа. Даже если старый лидер вернется в работу, лидер не сменится до тех пор, пока текущий лидер не выйдет из строя. Изменение приоритета восстановления после отказа не повлияет на это.

source: Every appointment (self-made or fetched) is immune for a while (controlled by the ``IMMUNITY_TIMEOUT`` option).
ru: Каждое назначение экземпляра лидером (неважно, назначил он себя сам или получил статус лидера) сохраняется на некоторое время (задается в параметре ``IMMUNITY_TIMEOUT``).

source: The case: external provider outage
ru: Сценарий: отключение внешнего поставщика

source: In this case instances do nothing: the leader remains a leader, read-only instances remain read-only. If any instance restarts during an external state provider outage, it composes an empty leadership map: it doesn't know who actually is a leader and thinks there is none.
ru: В этом случае экземпляры ничего не делают: лидер остается лидером, экземпляры только для чтения работают только на чтение. Если один экземпляр перезапустится во время отключения внешнего поставщика состояния, он составит пустой массив лидеров: он не знает, кто на самом деле является лидером, и считает, что его нет.

source: The case: coordinator outage
ru: Сценарий: отключение координатора

source: An active coordinator may be absent in a cluster either because of a failure or due to disabling the role everywhere. Just like in the previous case, instances do nothing about it: they keep fetching the leadership map from the state provider. But it will remain the same until a coordinator appears.
ru: В кластере может не быть активного координатора либо из-за сбоя, либо из-за повсеместного отключения роли. Как и в предыдущем случае, экземпляры ничего не будут делать: они продолжают получать массив лидеров от поставщика состояния. Но массив не изменится, пока не появится координатор.

source: Manual leader promotion
ru: Продвижение лидера вручную

source: It differs a lot depending on the failover mode.
ru: Продвижение лидера вручную сильно отличается в разных режимах восстановления после отказа.

source: In the disabled and eventual modes, you can only promote a leader by changing the failover priority (and applying a new clusterwide configuration).
ru: В режимах disabled и eventual продвинуть лидера можно только путем изменения приоритета восстановления после отказа (и применения новой конфигурации на уровне кластера).

source: In the stateful mode, the failover priority doesn't make much sense (except for the first appointment). Instead, you should use the promotion API (the Lua :ref:`cartridge.failover_promote <cartridge.failover_promote>` or the GraphQL ``mutation {cluster{failover_promote()}}``) which pushes manual appointments to the state provider.
ru: В режиме stateful приоритет восстановления после отказа не имеет особого смысла (кроме первого назначения). Вместо этого следует использовать API для продвижения (:ref:`cartridge.failover_promote <cartridge.failover_promote>` в Lua или ``mutation {cluster{failover_promote()}}`` в GraphQL), который передает данные о продвижении поставщику состояния.

source: The stateful failover mode implies **consistent promotion**: before becoming writable, each instance performs the ``wait_lsn`` operation to sync up with the previous one.
ru: Режим stateful подразумевает **последовательное продвижение**: прежде чем разрешить запись, каждый экземпляр выполняет операцию ``wait_lsn`` для синхронизации с предыдущим.

source: Information about the previous leader (we call it a *vclockkeeper*) is also stored on the external storage. Even when the old leader is demoted, it remains the vclockkeeper until the new leader successfully awaits and persists its vclock on the external storage.
ru: Информация о предыдущем лидере (мы называем его *vclockkeeper*) также хранится на внешнем хранилище. Даже после смещения старого лидера он остается vclockkeeper до тех пор, пока новый лидер успешно ждет и сохраняет vclock на внешнем хранилище.
