Repository: tarantool/cartridge
Catalog: rst/locale/*/LC_MESSAGES/cartridge_dev.po
Languages: ru

source: In this case, on a target server, add the Tarantool repository for the version equal or later than the one used for packing the application. This lets a package manager install the dependency correctly. See details for your OS on the `Download <https://www.tarantool.io/en/download/>`_ page.
ru: В этом случае на целевом сервере добавьте репозиторий Tarantool с той же версией, что использовалась при упаковке приложения, или более новой. Это позволит пакетному менеджеру корректно установить зависимости. Чтобы получить подробную информацию для вашей ОС, см. `страницу загрузки <https://www.tarantool.io/en/download/>`_.

source: For a production environment, it is recommended to use the ``systemd`` subsystem for managing the application instances and accessing log entries.
ru: В производственной среде для управления экземплярами приложения и доступа к записям журнала рекомендуется использовать подсистему ``systemd``.

source: To deploy your Tarantool Cartridge application:
ru: Чтобы развернуть приложение на Tarantool Cartridge, выполните следующие шаги:

source: Pack the application into a deliverable:
ru: Упакуйте приложения в распространяемый пакет:

source: $ cartridge pack rpm [APP_PATH] [--use-docker] $ # -- OR -- $ cartridge pack deb [APP_PATH] [--use-docker]
ru: $ cartridge pack rpm [APP_PATH] [--use-docker] $ # -- ИЛИ -- $ cartridge pack deb [APP_PATH] [--use-docker]

source: where
ru: где

source: ``APP_PATH``—a path to the application directory. Defaults to ``.`` (the current directory).
ru: ``APP_PATH`` — путь к директории приложения. Значение по умолчанию — ``.`` (текущая директория).

source: ``--use-docker``---the flag to use if packing the application on a different Linux distribution or on macOS. It ensures the resulting artifact contains the Linux compatible external modules and executables.
ru: ``--use-docker`` — флаг, который нужно использовать при упаковке приложения на различных листрибутивах Linux или на macOS. Он гарантирует что результирующий артефакт содержит совместимые с Linux модули и исполняемые файлы.

source: This creates an RPM or DEB package with the following naming: ``<APP_NAME>-<VERSION>.{rpm,deb}``. For example, ``./my_app-0.1.0-1-g8c57dcb.rpm`` or ``./my_app-0.1.0-1-g8c57dcb.deb``. For more details on the format and usage of the ``cartridge pack`` command, refer to the `command description <https://www.tarantool.io/en/doc/latest/book/cartridge/cartridge_cli/#packing-an-application>`_.
ru: В результате создается RPM- или DEB-пакет со следующим способом именования: ``<APP_NAME>-<VERSION>.{rpm,deb}``. Например, ``./my_app-0.1.0-1-g8c57dcb.rpm`` или ``./my_app-0.1.0-1-g8c57dcb.deb``. Чтобы больше узнать о формате и использовании команды ``cartridge pack``, прочитайте `ее описание <https://www.tarantool.io/en/doc/latest/book/cartridge/cartridge_cli/#packing-an-application>`_.

source: Upload the generated package to a target server.
ru: Загрузите сгенерированный пакет на целевой сервер.

source: Install the application:
ru: Установите приложение:

source: $ sudo yum install <APP_NAME>-<VERSION>.rpm $ # -- OR -- $ sudo dpkg -i <APP_NAME>-<VERSION>.deb
ru: $ sudo yum install <APP_NAME>-<VERSION>.rpm $ # -- ИЛИ -- $ sudo dpkg -i <APP_NAME>-<VERSION>.deb

source: Configure the application instances.
ru: Настройте экземпляры приложения.

source: The configuration is stored in the ``/etc/tarantool/conf.d/instances.yml`` file. Create the file and specify parameters of the instances. For details, refer to :ref:`cartridge-config`.
ru: Конфигурация хранится в файле ``/etc/tarantool/conf.d/instances.yml``. Создайте этот файл и укажите параметры экземпляров. Подробности читайте в :ref:`cartridge-config`.

source: Do not specify working directories of the instances in this configuration. They are defined via the ``TARANTOOL_WORKDIR`` environmental variable in the instantiated unit file (``/etc/systemd/system/<APP_NAME>@.service``).
ru: Не указывайте среди этих настроек рабочие директории экземпляров. Используйте для этого переменную окружения ``TARANTOOL_WORKDIR`` в юнит-файле для каждого из соответствующих экземпляров (``/etc/systemd/system/<APP_NAME>@.service``).

source: Start the application instances by using ``systemctl``.
ru: Запустите экземпляры приложения с помощью команды ``systemctl``.

source: For more details, see :ref:`cartridge-run-systemctl`.
ru: Подробности читайте на странице :ref:`cartridge-run-systemctl`.

source: In case of a cluster-aware application, proceed to :ref:`deploying the cluster <cartridge-deployment>`.
ru: Если ваше приложение поддерживает кластеры, переходите к :ref:`развертыванию кластера <cartridge-deployment>`.

source: If you're migrating your application from local test environment to production, you can re-use your test configuration at this step:
ru: При переносе приложения из локальной среды тестирования на рабочий сервер на этом этапе можно переиспользовать тестовые настройки:

source: In the cluster web interface of the test environment, click **Configuration files > Download** to save the test configuration.
ru: В веб-интерфейсе кластера тестовой среды нажмите **Configuration files > Download**, чтобы сохранить тестовую конфигурацию.

source: In the cluster web interface of the production environment, click **Configuration files > Upload** to upload the saved configuration.
ru: В веб-интерфейсе кластера на рабочем сервере нажмите **Configuration files > Upload**, чтобы загрузить сохраненную конфигурацию.

source: You can further manage the running instances by using the standard operations of the ``systemd`` utilities:
ru: Вы можете затем управлять работающими экземплярами, используя стандартные операции утилит ``systemd``:

source: ``systemctl`` for stopping, re-starting, checking the status of the instances, and so on
ru: ``systemctl`` — для остановки, перезапуска, проверки статуса экземпляров и т. д.;

source: ``journalctl`` for collecting logs of the instances.
ru: ``journalctl`` для работы с журналами экземпляров.

source: Entities created during installation
ru: Сущности, создаваемые во время установки

source: During the installation of a Tarantool Cartridge application, the following entities are additionally created:
ru: Во время установки приложения на Tarantool Cartridge дополнительно создаются следующие сущности:

source: The ``tarantool`` user group.
ru: Группа (user group) ``tarantool``.

source: The ``tarantool`` system user. All the application instances start under this user. The ``tarantool`` user group is the main group for the ``tarantool`` user. The user is created with the option ``-s /sbin/nologin``.
ru: Системный пользователь ``tarantool``. Все экземпляры приложения запускаются от имени этого пользователя. Группа ``tarantool`` — основная группа пользователя ``tarantool``. Пользователь создается с параметром ``-s /sbin/nologin``.

source: Directories and files listed in the table below (``<APP_NAME>`` is the application name, ``%i`` is the instance name):
ru: Директории и файлы, перечисленные в таблице ниже (<APP_NAME> — имя приложения, ``%i`` — имя экземпляра):

source: Path
ru: Путь

source: Access Rights
ru: Права доступа

source: Owner:Group
ru: Владелец:Группа

source: Description
ru: Описание

source: systemd unit file for the <APP_NAME> service
ru: юнит-файл systemd для сервиса <APP_NAME>

source: systemd instantiated unit file for the <APP_NAME> service
ru: юнит-файл systemd, позволяющий запускать экземпляры сервиса <APP_NAME>

source: Directory. Contains executable files of the application.
ru: Директория. Содержит исполняемые файлы приложения.

source: Directory for YAML files with the configuration of the application instances, such as ``instances.yml``.
ru: Директория для YAML-файлов с конфигурацией экземпляров приложений, таких как ``instances.yml``.

source: Working directories of the application instances. Each directory contains the instance data, namely, the WAL and snapshot files, and also the application configuration YAML files.
ru: Рабочие директории экземпляров приложения. Каждая директория содержит данные экземпляра, а именно: файлы WAL и файлы-снимки, а также файлы конфигурации приложения в формате YAML.

source: Directory. Contains the following files for each instance: ``<APP_NAME>.%i.pid`` and ``<APP_NAME>.%i.control``.
ru: Директория. Содержит следующие файлы для каждого экземпляра: ``<APP_NAME>.%i.pid`` и ``<APP_NAME>.%i.control``.

source: Contains the process ID.
ru: Содержит ID процесса.

source: Unix socket to connect to the instance via the `tarantoolctl <https://www.tarantool.io/en/doc/latest/reference/tarantoolctl/>`_ utility.
ru: Unix-сокет для подключения к экземпляру с помощью утилиты `tarantoolctl <https://www.tarantool.io/en/doc/latest/reference/tarantoolctl/>`_.

source: Deploying as a tar+gz archive
ru: Развертывание архива tar+gz

source: Pack the application into a distributable:
ru: Упакуйте файлы приложения в распространяемый пакет:

source: This will create a tar+gz archive (e.g. ``./my_app-0.1.0-1.tgz``).
ru: Будет создан архив tar+gz (например, ``./my_app-0.1.0-1.tgz``).

source: Upload the archive to target servers, with ``tarantool`` and (optionally) :ref:`cartridge-cli <cartridge-install-dev>` installed.
ru: Загрузите архив на серверы, на которых установлены ``tarantool`` и (необязательно) :ref:`cartridge-cli <cartridge-install-dev>`.

source: Extract the archive:
ru: Распакуйте архив:

source: Configure the instance(s). Create a file called ``/etc/tarantool/conf.d/instances.yml``. For example:
ru: Настройте экземпляр(ы). Создайте файл под названием ``/etc/tarantool/conf.d/instances.yml``. Например:

source: See details :ref:`here <cartridge-config>`.
ru: См. описание :ref:`здесь <cartridge-config>`.

source: Start Tarantool instance(s). You can do it using:
ru: Запустите экземпляры Tarantool. Это можно сделать, используя:

source: :ref:`tarantool <cartridge-run-tarantool>`, for example:
ru: :ref:`tarantoolctl <cartridge-run-tarantool>`, например:

source: $ tarantool init.lua # starts a single instance
ru: $ tarantool init.lua # запускает один экземпляр

source: or :ref:`cartridge <cartridge-run-cartridge>`, for example:
ru: или :ref:`cartridge <cartridge-run-cartridge>`, например:

source: $ # in application directory $ cartridge start # starts all instances $ cartridge start .router_1 # starts a single instance $ # in multi-application environment $ cartridge start my_app # starts all instances of my_app $ cartridge start my_app.router # starts a single instance
ru: $ # в директории приложения $ cartridge start # запускает все экземпляры $ cartridge start .router_1 # запускает один экземпляр $ # в среде с несколькими приложениями $ cartridge start my_app # запускает все экземпляры приложения my_app $ cartridge start my_app.router # запускает один экземпляр

source: In case it is a cluster-aware application, proceed to :ref:`deploying the cluster <cartridge-deployment>`.
ru: Если это приложение с поддержкой кластеров, далее переходите к :ref:`развертыванию кластера <cartridge-deployment>`.

source: Deploying from sources
ru: Развертывание из исходных файлов

source: This deployment method is intended for local testing only.
ru: Такой метод развертывания предназначен только для локального тестирования.

source: Pull all dependencies to the ``.rocks`` directory:
ru: Вытяните все зависимости в каталог ``.rocks``:

source: Starting/stopping instances
ru: Запуск/остановка экземпляров

source: Depending on your :ref:`deployment method <cartridge-deploy>`, you can start/stop the instances using :ref:`tarantool <cartridge-run-tarantool>`, :ref:`cartridge CLI <cartridge-run-cartridge>`, or :ref:`systemctl <cartridge-run-systemctl>`.
ru: В зависимости от :ref:`способа развертывания <cartridge-deploy>` вы можете запускать/останавливать экземпляры, используя :ref:`tarantool <cartridge-run-tarantool>`, :ref:`интерфейс командной строки cartridge <cartridge-run-cartridge>` или :ref:`systemctl <cartridge-run-systemctl>`.

source: Start/stop using tarantool
ru: Запуск и остановка с помощью tarantool

source: With ``tarantool``, you can start only a single instance:
ru: С помощью ``tarantool`` можно запустить только один экземпляр:

source: # the simplest command $ tarantool init.lua
ru: # простейшая команда $ tarantool init.lua

source: You can also :ref:`specify more options <cartridge-config-tarantool>` on the command line or in environment variables.
ru: Можно также :ref:`задать дополнительные параметры <cartridge-config-tarantool>` в командной строке или в переменных окружения.

source: To stop the instance, use Ctrl+C.
ru: Чтобы остановить экземпляр, используйте Ctrl+C.

source: Start/stop using cartridge CLI
ru: Запуск и остановка с помощью CLI в cartridge

source: With ``cartridge`` CLI, you can start one or multiple instances:
ru: С помощью интерфейса командной строки ``cartridge``, можно запустить один или несколько экземпляров:

source: The options are:
ru: Возможные параметры:

source: Application's entry point. Defaults to:
ru: Точка входа в приложение. По умолчанию:

source: ``TARANTOOL_SCRIPT``, or
ru: ``TARANTOOL_SCRIPT``, либо

source: ``./init.lua`` when running from the app's directory, or
ru: ``./init.lua``, если запуск идет из каталога приложения, или же

source: ``:apps_path/:app_name/init.lua`` in a multi-app environment.
ru: ``:путь_к_приложениям/:имя_приложения/init.lua`` в среде с несколькими приложениями.

source: Path to apps directory when running in a multi-app environment. Defaults to ``/usr/share/tarantool``.
ru: Путь к каталогу с приложениями при запуске из среды с несколькими приложениями. По умолчанию: ``/usr/share/tarantool``.

source: Directory with pid and sock files. Defaults to ``TARANTOOL_RUN_DIR`` or ``/var/run/tarantool``.
ru: Каталог с файлами pid и sock. По умолчанию: ``TARANTOOL_RUN_DIR`` или ``/var/run/tarantool``.

source: Cartridge instances YAML configuration file. Defaults to ``TARANTOOL_CFG`` or ``./instances.yml``. The ``instances.yml`` file contains ``cartridge.cfg()`` parameters described in the :ref:`configuration section <cartridge-config-basic>` of this guide.
ru: Файл конфигурации в формате YAML для экземпляра Cartridge. По умолчанию: ``TARANTOOL_CFG`` или ``./instances.yml``. Файл ``instances.yml`` содержит параметры ``cartridge.cfg()``, которые описаны в :ref:`разделе о конфигурации <cartridge-config-basic>`.

source: Do not daemonize.
ru: Не в фоне.

source: It starts all ``tarantool`` instances specified in ``cfg`` file, in foreground, with enforced :ref:`environment variables <cartridge-config>`.
ru: Это запустит все экземпляры Tarantool, указанные в файле ``cfg``, не в фоновом режиме с принудительным использованием :ref:`переменных окружения <cartridge-config>`.

source: When ``APP_NAME`` is not provided, ``cartridge`` parses it from ``./*.rockspec`` filename.
ru: Если ``APP_NAME`` не указано, ``cartridge`` выделит его из имени файла ``./*.rockspec``.

source: When ``INSTANCE_NAME`` is not provided, ``cartridge`` reads ``cfg`` file and starts all defined instances:
ru: Если ``ИМЯ_ЭКЗЕМПЛЯРА`` не указывается, ``cartridge`` прочитает файл ``cfg`` и запустит все указанные экземпляры:

source: To stop the instances, run:
ru: Чтобы остановить экземпляры, выполните команду:

source: These options from the ``cartridge start`` command are supported:
ru: Поддерживаются следующие параметры из команды ``cartridge start``:

source: Start/stop using systemctl
ru: Запуск и остановка с помощью systemctl

source: To run a single instance:
ru: Чтобы запустить отдельный экземпляр:

source: This will start a ``systemd`` service that will listen to the port specified in :ref:`instance configuration <cartridge-run-systemctl-config>` (``http_port`` parameter).
ru: Это запустит службу ``systemd``, которая будет прослушивать порт, указанный в :ref:`конфигурации экземпляра <cartridge-run-systemctl-config>` (параметр ``http_port``).

source: To run multiple instances on one or multiple servers:
ru: Чтобы запустить несколько экземпляров на одном или нескольких серверах:

source: where ``APP_NAME@INSTANCE_N`` is the instantiated service name for ``systemd`` with an incremental ``N`` -- a number, unique for every instance, added to the port the instance will listen to (e.g., ``3301``, ``3302``, etc.)
ru: где ``APP_NAME@INSTANCE_N`` -- это имя экземпляра сервиса ``systemd`` с инкрементным числом N (уникальным для каждого экземпляра), которое следует добавить к порту ``3300`` для настройки прослушивания (например, ``3301``, ``3302`` и т.д.).

source: To stop all services on a server, use the ``systemctl stop`` command and specify instance names one by one. For example:
ru: Чтобы остановить все сервисы на сервере, используйте команду ``systemctl stop`` и укажите имена экземпляров по одному. Например:

source: When running instances with ``systemctl``, keep these practices in mind:
ru: При запуске экземпляров с помощью ``systemctl`` следует помнить о следующих правилах:

source: You can specify *instance configuration* in a YAML file.
ru: Можно задать *конфигурацию экземпляра* в YAML-файле.

source: This file can contain `these options <https://www.tarantool.io/en/doc/latest/book/cartridge/cartridge_api/modules/cartridge.argparse/#tables>`_; see an example `here <https://www.tarantool.io/en/doc/latest/book/cartridge/cartridge_cli/#usage-example>`_).
ru: В этом файле могут быть `эти параметры <https://www.tarantool.io/en/doc/latest/book/cartridge/cartridge_api/modules/cartridge.argparse/#tables>`_; см. пример `здесь <https://www.tarantool.io/en/doc/latest/book/cartridge/cartridge_cli/#usage-example>`_).

source: Save this file to ``/etc/tarantool/conf.d/`` (the default ``systemd`` path) or to a location set in the ``TARANTOOL_CFG`` environment variable (if you've edited the application's ``systemd`` unit file). The file name doesn't matter: it can be ``instances.yml`` or anything else you like.
ru: Сохраните этот файл в ``/etc/tarantool/conf.d/`` (путь по умолчанию для ``systemd``) или в место, указанное в переменной окружения ``TARANTOOL_CFG`` (если вы отредактировали файл ``systemd`` в своем приложении). Имя файла не имеет значения — может быть ``instances.yml`` или любое другое, которое вам нравится.

source: Here's what ``systemd`` is doing further:
ru: Вот что ``systemd`` делает дальше:

source: obtains ``app_name`` (and ``instance_name``, if specified) from the name of the application's ``systemd`` unit file (e.g. ``APP_NAME@default`` or ``APP_NAME@INSTANCE_1``);
ru: получает ``app_name`` (и ``instance_name``, если оно указано) из имени файла ``systemd`` (например, ``APP_NAME@default`` или ``APP_NAME@INSTANCE_1``);

source: sets default console socket (e.g. ``/var/run/tarantool/APP_NAME@INSTANCE_1.control``), PID file (e.g. ``/var/run/tarantool/APP_NAME@INSTANCE_1.pid``) and ``workdir`` (e.g. ``/var/lib/tarantool/<APP_NAME>.<INSTANCE_NAME>``). ``Environment=TARANTOOL_WORKDIR=${workdir}.%i``
ru: задает значения по умолчанию для сокета консоли (например, ``/var/run/tarantool/APP_NAME@INSTANCE_1.control``), PID-файла (например, ``/var/run/tarantool/APP_NAME@INSTANCE_1.pid``) и параметра ``workdir`` (например, ``/var/lib/tarantool/<APP_NAME>.<INSTANCE_NAME>``). ``Environment=TARANTOOL_WORKDIR=${workdir}.%i``

source: Finally, ``cartridge`` looks across all YAML files in ``/etc/tarantool/conf.d`` for a section with the appropriate name (e.g. ``app_name`` that contains common configuration for all instances, and ``app_name.instance_1`` that contain instance-specific configuration). As a result, Cartridge options ``workdir``, ``console_sock``, and ``pid_file`` in the YAML file `cartridge.cfg <https://www.tarantool.io/en/doc/latest/book/cartridge/cartridge_api/modules/cartridge/#cfg-opts-box-opts>`_ become useless, because ``systemd`` overrides them.
ru: Наконец, ``cartridge`` ищет раздел с соответстующим названием (например, ``app_name``, который содержит общую конфигурацию для всех экземпляров, и ``app_name.instance_1``, который содержит конфигурацию для конкретного экземпляра) по всем YAML-файлам в ``/etc/tarantool/conf.d``. В результате параметры Cartridge ``workdir``, ``console_sock`` и ``pid_file`` в YAML-файле `cartridge.cfg <https://www.tarantool.io/en/doc/latest/book/cartridge/cartridge_api/modules/cartridge/#cfg-opts-box-opts>`_ будут бесполезны, потому что ``systemd`` переопределит их.

source: The default tool for querying logs is `journalctl <https://www.freedesktop.org/software/systemd/man/journalctl.html>`_. For example:
ru: Для запросов по журналам по умолчанию используется `journalctl <https://www.freedesktop.org/software/systemd/man/journalctl.html>`_. Например:

source: $ # show log messages for a systemd unit named APP_NAME.INSTANCE_1 $ journalctl -u APP_NAME.INSTANCE_1 $ # show only the most recent messages and continuously print new ones $ journalctl -f -u APP_NAME.INSTANCE_1
ru: $ # показать журнал сообщений для юнит-файла systemd с именем APP_NAME.INSTANCE_1 $ journalctl -u APP_NAME.INSTANCE_1 $ # показать только самые последние сообщения и затем продолжать выводить новые $ journalctl -f -u APP_NAME.INSTANCE_1

source: If really needed, you can change logging-related ``box.cfg`` options in the YAML configuration file: see `log <https://www.tarantool.io/en/doc/2.3/reference/configuration/#confval-log>`_ and other related options.
ru: Если действительно нужно, можно изменить связанные с журналированием параметры ``box.cfg`` в конфигурационном YAML-файле: см. `log <https://www.tarantool.io/en/doc/2.3/reference/configuration/#confval-log>`_ и другие необходимые параметры.

source: Error handling guidelines
ru: Рекомендации по обработке ошибок

source: Almost all errors in Cartridge follow the ``return nil, err`` style, where ``err`` is an error object produced by Tarantool's `errors <https://github.com/tarantool/errors>`_ module. Cartridge doesn't raise errors except for bugs and functions contracts mismatch. Developing new roles should follow these guidelines as well.
ru: Почти все ошибки в Cartridge создаются по формату ``return nil, err``, где ``err`` — объект ошибки, созданный модулем `errors <https://github.com/tarantool/errors>`_. Cartridge не выдает ошибки, за исключением ошибок кода и несоответствия контрактов функций. При разработке новых ролей также нужно следовать этим рекомендациям.

source: Error objects in Lua
ru: Объекты ошибок в Lua

source: Error classes help to locate the problem's source. For this purpose, an error object contains its class, stack traceback, and a message.
ru: Классы ошибок помогают обнаружить источник проблемы. Для этого объект ошибки содержит имя своего класса, трассировку стека и сообщение.

source: local errors = require('errors') local DangerousError = errors.new_class("DangerousError") local function some_fancy_function() local something_bad_happens = true if something_bad_happens then return nil, DangerousError:new("Oh boy") end return "success" -- not reachable due to the error end print(some_fancy_function())
ru: local errors = require('errors') local DangerousError = errors.new_class("DangerousError") local function some_fancy_function() local something_bad_happens = true if something_bad_happens then return nil, DangerousError:new("Oh boy") end return "success" -- недостижимо из-за ошибки end print(some_fancy_function())

source: For uniform error handling, ``errors`` provides the ``:pcall`` API:
ru: Для равномерной обработки ошибок в ``errors`` есть API ``:pcall``:

source: For ``errors.pcall`` there is no difference between the ``return nil, err`` and ``error()`` approaches.
ru: Для ``errors.pcall`` нет никакой разницы между ``return nil, err`` и ``error()``.
