Repository: tarantool/cartridge
Catalog: rst/locale/*/LC_MESSAGES/cartridge_dev.po
Languages: ru

source: The cluster displays the names of all custom roles along with the built-in ``vshard-*`` roles in the :ref:`web interface <cartridge-deployment>`. Cluster administrators can enable and disable them for particular instances -- either via the web interface or via the cluster `public API <https://www.tarantool.io/en/rocks/cartridge/1.0/modules/cartridge.admin/#edit-topology-args>`_. For example:
ru: Кластер отображает все имена пользовательских ролей вместе с именами встроенных ролей из ``vshard`` в :ref:`веб-интерфейсе <cartridge-deployment>`. Администраторы кластера могут включать и отключать их для определенных экземпляров либо в веб-интерфейсе, либо с помощью `общедоступного API <https://www.tarantool.io/en/rocks/cartridge/1.0/modules/cartridge.admin/#edit-topology-args>`_. Например:

source: If you enable multiple roles on an instance at the same time, the cluster first initializes the built-in roles (if any) and then the custom ones (if any) in the order the latter were listed in ``cartridge.cfg()``.
ru: Если несколько ролей одновременно включены на экземпляре, кластер сначала инициализирует встроенные роли (если они есть), а затем пользовательские (если они есть) в том порядке, в котором пользовательские роли были перечислены в ``cartridge.cfg()``.

source: If a custom role has dependent roles, the dependencies are registered and validated first, *prior* to the role itself.
ru: Если для пользовательской роли есть зависимые роли, сначала происходит регистрация и валидация зависимостей, а *затем* уже самой роли.

source: The cluster calls the role's functions in the following circumstances:
ru: Кластер вызывает функции роли в следующих случаях:

source: The ``init()`` function, typically, once: either when the role is enabled by the administrator or at the instance restart. Enabling a role once is normally enough.
ru: Функция ``init()`` обычно выполняется один раз: либо когда администратор включает роль, либо при перезапуске экземпляра. Как правило, достаточно один раз включить роль.

source: The ``stop()`` function -- only when the administrator disables the role, not on instance termination.
ru: Функция ``stop()`` -- только когда администратор отключает роль, а не во время завершения работы экземпляра.

source: The ``validate_config()`` function, first, before the automatic ``box.cfg()`` call (database initialization), then -- upon every configuration update.
ru: Функция ``validate_config()``: сначала до автоматического вызова ``box.cfg()`` (инициализация базы данных), а затем при каждом обновлении конфигурации.

source: The ``apply_config()`` function upon every configuration update.
ru: Функция ``apply_config()`` -- при каждом обновлении конфигурации.

source: As a tryout, let's task the cluster with some actions and see the order of executing the role's functions:
ru: В качестве эксперимента дадим кластеру некоторые задачи и посмотрим порядок выполнения функций роли:

source: Join an instance or create a replica set, both with an enabled role:
ru: Присоединение экземпляра или создание набора реплик (в обоих случаях с включенной ролью):

source: Restart an instance with an enabled role:
ru: Перезапуск экземпляра с включенной ролью:

source: Disable role: ``stop()``.
ru: Отключение роли: ``stop()``.

source: Upon the ``cartridge.confapplier.patch_clusterwide()`` call:
ru: При вызове ``cartridge.confapplier.patch_clusterwide()``:

source: Upon a triggered failover:
ru: При запущенном восстановлении после отказа:

source: Considering the described behavior:
ru: Учитывая вышеописанное поведение:

source: The ``init()`` function may:
ru: Функция ``init()`` может:

source: Call ``box`` functions.
ru: Вызывать функции ``box``.

source: Start a fiber and, in this case, the ``stop()`` function should take care of the fiber's termination.
ru: Запускать файбер, и в таком случае функция ``stop()`` должна позаботиться о завершении работы файбера.

source: Configure the built-in :ref:`HTTP server <cartridge-httpd-instance>`.
ru: Настраивать встроенный :ref:`HTTP-сервер <cartridge-httpd-instance>`.

source: Execute any code related to the role's initialization.
ru: Выполнять любой код, связанный с инициализацией роли.

source: The ``stop()`` functions must undo any job that needs to be undone on role's termination.
ru: Функции ``stop()`` должны отменять любую задачу, которую нужно отменить при завершении работы роли.

source: The ``validate_config()`` function must validate any configuration change.
ru: Функция ``validate_config()`` должна валидировать любые изменения конфигурации.

source: The ``apply_config()`` function may execute any code related to a configuration change, e.g., take care of an ``expirationd`` fiber.
ru: Функция ``apply_config()`` может выполнять любой код, связанный с изменением конфигурации, например, следить за файбером ``expirationd``.

source: The validation and application functions together allow you to change the cluster-wide configuration as described in the :ref:`next section <cartridge-role-config>`.
ru: Функции валидации и применения конфигурации позволяют настроить конфигурацию всего кластера, как описано в :ref:`следующем разделе <cartridge-role-config>`.

source: Configuring custom roles
ru: Конфигурация пользовательских ролей

source: You can:
ru: Вы можете:

source: Store configurations for your custom roles as sections in cluster-wide configuration, for example:
ru: Хранить настройки пользовательских ролей в виде разделов в конфигурации на уровне кластера, например:

source: # in YAML configuration file my_role: notify_url: "https://localhost:8080"
ru: # в конфигурационном YAML-файле my_role: notify_url: "https://localhost:8080"

source: -- in init.lua file local notify_url = 'http://localhost' function my_role.apply_config(conf, opts) local conf = conf['my_role'] or {} notify_url = conf.notify_url or 'default' end
ru: -- в файле init.lua local notify_url = 'http://localhost' function my_role.apply_config(conf, opts) local conf = conf['my_role'] or {} notify_url = conf.notify_url or 'default' end

source: Download and upload cluster-wide configuration using the :ref:`web interface <cartridge-ui-configuration>` or API (via GET/PUT queries to ``admin/config`` endpoint like ``curl localhost:8081/admin/config`` and ``curl -X PUT -d "{'my_parameter': 'value'}" localhost:8081/admin/config``).
ru: Загружать и выгружать конфигурацию всего кластера через :ref:`веб-интерфейс <cartridge-ui-configuration>` или с помощью API (запросы GET/PUT к конечной точке ``admin/config``: ``curl localhost:8081/admin/config`` и ``curl -X PUT -d "{'my_parameter': 'value'}" localhost:8081/admin/config``).

source: Utilize it in your role's ``apply_config()`` function.
ru: Использовать ее в функции ``apply_config()`` в своей роли.

source: Every instance in the cluster stores a copy of the configuration file in its working directory (configured by ``cartridge.cfg({workdir = ...})``):
ru: Каждый экземпляр в кластере хранит копию конфигурационного файла в своем рабочем каталоге (который можно задать с помощью ``cartridge.cfg({workdir = ...})``):

source: ``/var/lib/tarantool/<instance_name>/config.yml`` for instances deployed from RPM packages and managed by ``systemd``.
ru: ``/var/lib/tarantool/<instance_name>/config.yml`` для экземпляров, развернутых из RPM-пакетов, под управлением ``systemd``.

source: ``/home/<username>/tarantool_state/var/lib/tarantool/config.yml`` for instances deployed from tar+gz archives.
ru: ``/home/<username>/tarantool_state/var/lib/tarantool/config.yml`` для экземпляров, развернутых из архивов tar+gz.

source: The cluster's configuration is a Lua table, downloaded and uploaded as YAML. If some application-specific configuration data, e.g. a database schema as defined by DDL (data definition language), needs to be stored on every instance in the cluster, you can implement your own API by adding a custom section to the table. The cluster will help you spread it safely across all instances.
ru: Конфигурация кластера представляет собой Lua-таблицу, которую можно загрузить и выгрузить в формате YAML. Если в каждом экземпляре кластера необходимо хранить какие-то данные конфигурации для конкретного приложения (например, схему базы данных, описанную с помощью языка определения данных DDL), можно использовать свой собственный API, добавив в таблицу специальный раздел. Кластер поможет вам безопасно передать настройки всем экземплярам.

source: Such section goes in the same file with topology-specific and ``vshard``-specific sections that the cluster generates automatically. Unlike the generated, the custom section's modification, validation, and application logic has to be defined.
ru: Этот раздел нужно создавать в том же файле, что и разделы по топологии и по ``vshard``, которые кластер генерирует автоматически. Но в отличие от сгенерированных разделов, в специальном разделе необходимо определять вручную логику изменения, проверки и применения конфигурации.

source: The common way is to define two functions:
ru: Самый распространенный способ заключается в том, чтобы:

source: ``validate_config(conf_new, conf_old)`` to validate changes made in the new configuration (``conf_new``) versus the old configuration (``conf_old``).
ru: ``validate_config(conf_new, conf_old)`` для валидации изменений, сделанных в новой конфигурации (``conf_new``) по отношению к старой конфигурации (``conf_old``).

source: ``apply_config(conf, opts)`` to execute any code related to a configuration change. As input, this function takes the configuration to apply (``conf``, which is actually the new configuration that you validated earlier with ``validate_config()``) and options (the ``opts`` argument that includes ``is_master``, a Boolean flag described later).
ru: ``apply_config(conf, opts)`` для выполнения любого кода, связанного с изменениями конфигурации. Входными данными для этой функции будут применяемая конфигурация (``conf``, которая и есть новая конфигурация, проверенная чуть ранее с помощью ``validate_config()``), а также параметры (аргумент ``opts`` включает в себя описываемый ниже логический флаг ``is_master`` ).

source: The ``validate_config()`` function must detect all configuration problems that may lead to ``apply_config()`` errors. For more information, see the :ref:`next section <cartridge-role-config-apply>`.
ru: Функция ``validate_config()`` должна обнаружить все проблемы конфигурации, которые могут привести к ошибкам ``apply_config()``. Для получения дополнительной информации см. :ref:`следующий раздел <cartridge-role-config-apply>`.

source: When implementing validation and application functions that call ``box`` ones for some reason, mind the following precautions:
ru: При реализации функций валидации и применения конфигурации, которые по какой-либо причине вызывают функции ``box``, следует принять меры предосторожности:

source: Due to the :ref:`role's life cycle <cartridge-role-lifecycle>`, the cluster does not guarantee an automatic ``box.cfg()`` call prior to calling ``validate_config()``.
ru: :ref:`Жизненный цикл роли <cartridge-role-lifecycle>` не предполагает, что кластер автоматически вызовет ``box.cfg()`` до вызова ``validate_config()``.

source: If the validation function calls any ``box`` functions (e.g., to check a format), make sure the calls are wrapped in a protective conditional statement that checks if ``box.cfg()`` has already happened:
ru: Если функция валидации конфигурации вызывает функции из ``box`` (например, для проверки формата), убедитесь, что вызовы включены в защитный условный оператор, который проверяет, был ли уже вызов ``box.cfg()``:

source: -- Inside the validate_config() function: if type(box.cfg) == 'table' then -- Here you can call box functions end
ru: -- Внутри функции validate_config(): if type(box.cfg) == 'table' then -- Здесь вы можете вызывать функции из box end

source: Unlike the validation function, ``apply_config()`` can call ``box`` functions freely as the cluster applies custom configuration after the automatic ``box.cfg()`` call.
ru: В отличие от функции валидации, ``apply_config()`` может свободно вызывать функции из ``box``, потому что кластер применяет пользовательскую конфигурацию после автоматического вызова ``box.cfg()``.

source: However, creating spaces, users, etc., can cause replication collisions when performed on both master and replica instances simultaneously. The appropriate way is to call such ``box`` functions *on masters only* and let the changes propagate to replicas automatically.
ru: Тем не менее, создание спейсов, пользователей и т. д. может вызвать конфликты репликации при одновременном выполнении на мастере и на реплике. Лучше всего вызывать такие функции из ``box`` *только на мастерах*, а на реплики изменения отправятся автоматически.

source: Upon the ``apply_config(conf, opts)`` execution, the cluster passes an ``is_master`` flag in the ``opts`` table which you can use to wrap collision-inducing ``box`` functions in a protective conditional statement:
ru: По выполнении ``apply_config(conf, opts)`` кластер передает флаг ``is_master`` в таблице ``opts``, который можно использовать для заключения функций из ``box`` в защитный условный оператор, если они могут вызвать конфликт:

source: -- Inside the apply_config() function: if opts.is_master then -- Here you can call box functions end
ru: -- Внутри функции apply_config(): if opts.is_master then -- Здесь вы можете вызывать функции из box end

source: Custom configuration example
ru: Пример пользовательской конфигурации

source: Consider the following code as part of the role's module (``custom-role.lua``) implementation:
ru: Рассмотрим следующий код как часть реализации модуля роли (``custom-role.lua``):

source: -- Custom role implementation local cartridge = require('cartridge') local role_name = 'custom-role' -- Modify the config by implementing some setter (an alternative to HTTP PUT) local function set_secret(secret) local custom_role_cfg = cartridge.confapplier.get_deepcopy(role_name) or {} custom_role_cfg.secret = secret cartridge.confapplier.patch_clusterwide({ [role_name] = custom_role_cfg, }) end -- Validate local function validate_config(cfg) local custom_role_cfg = cfg[role_name] or {} if custom_role_cfg.secret ~= nil then assert(type(custom_role_cfg.secret) == 'string', 'custom-role.secret must be a string') end return true end -- Apply local function apply_config(cfg) local custom_role_cfg = cfg[role_name] or {} local secret = custom_role_cfg.secret or 'default-secret' -- Make use of it end return { role_name = role_name, set_secret = set_secret, validate_config = validate_config, apply_config = apply_config, }
ru: -- Реализация пользовательской роли local cartridge = require('cartridge') local role_name = 'custom-role' -- Измените конфигурацию, реализовав свой метод, устанавливающий значение поля (как альтернативу для HTTP PUT) local function set_secret(secret) local custom_role_cfg = cartridge.confapplier.get_deepcopy(role_name) or {} custom_role_cfg.secret = secret cartridge.confapplier.patch_clusterwide({ [role_name] = custom_role_cfg, }) end -- Валидируйте конфигурацию local function validate_config(cfg) local custom_role_cfg = cfg[role_name] or {} if custom_role_cfg.secret ~= nil then assert(type(custom_role_cfg.secret) == 'string', 'custom-role.secret must be a string') end return true end -- Примените её local function apply_config(cfg) local custom_role_cfg = cfg[role_name] or {} local secret = custom_role_cfg.secret or 'default-secret' -- И используйте end return { role_name = role_name, set_secret = set_secret, validate_config = validate_config, apply_config = apply_config, }

source: Once the configuration is customized, do one of the following:
ru: После настройки конфигурации выполните одно из следующих действий:

source: continue developing your application and pay attention to its :ref:`versioning <cartridge-versioning>`;
ru: продолжите разработку приложения, обращая особое внимание на :ref:`управление версиями <cartridge-versioning>`;

source: (optional) :ref:`enable authorization <cartridge-auth-enable>` in the web interface.
ru: (необязательно) :ref:`включите авторизацию <cartridge-auth-enable>` в веб-интерфейсе.

source: in case the cluster is already deployed, :ref:`apply the configuration <cartridge-role-config-apply>` cluster-wide.
ru: если кластер уже развернут, :ref:`примените конфигурацию <cartridge-role-config-apply>` для всего кластера.

source: Applying custom role's configuration
ru: Применение конфигурации пользовательской роли

source: With the implementation showed by the :ref:`example <cartridge-role-config-example>`, you can call the ``set_secret()`` function to apply the new configuration via the administrative console -- or an HTTP endpoint if the role exports one.
ru: В :ref:`примере <cartridge-role-config-example>` реализации можно вызвать функцию ``set_secret()``, чтобы применить новую конфигурацию с помощью административной консоли или конечной точки HTTP, если роль ее экспортирует.

source: The ``set_secret()`` function calls ``cartridge.confapplier.patch_clusterwide()`` which performs a two-phase commit:
ru: Функция ``set_secret()`` вызывает ``cartridge.confapplier.patch_clusterwide()``, которая производит двухфазную фиксацию транзакций:

source: It patches the active configuration in memory: copies the table and replaces the ``"custom-role"`` section in the copy with the one given by the ``set_secret()`` function.
ru: Исправляет активную конфигурацию в памяти: копирует таблицу и заменяет раздел ``"custom-role"`` в копии на раздел, который задан функцией ``set_secret()``.

source: The cluster checks if the new configuration can be applied on all instances except disabled and expelled. All instances subject to update must be healthy and ``alive`` according to the `membership module <https://www.tarantool.io/en/doc/latest/reference/reference_rock/membership/>`_.
ru: Кластер проверяет, можно ли применить новую конфигурацию ко всем экземплярам, кроме отключенных и исключенных. Все обновляемые экземпляры должны быть исправными и в статусе ``alive`` в соответствии с требованиями `модуля membership <https://www.tarantool.io/en/doc/latest/reference/reference_rock/membership/>`_.

source: (**Preparation phase**) The cluster propagates the patched configuration. Every instance validates it with the ``validate_config()`` function of every registered role. Depending on the validation's result:
ru: (**Фаза подготовки**) Кластер передает исправленную конфигурацию. Каждый экземпляр валидирует ее с помощью функции ``validate_config()`` из каждой зарегистрированной роли. В зависимости от результата валидации:

source: If successful (i.e., returns ``true``), the instance saves the new configuration to a temporary file named ``config.prepare.yml`` within the working directory.
ru: В случае успеха (то есть возврата значения ``true``) экземпляр сохраняет новую конфигурацию во временный файл с именем ``config.prepare.yml`` в рабочем каталоге.

source: (**Abort phase**) Otherwise, the instance reports an error and all the other instances roll back the update: remove the file they may have already prepared.
ru: (**Фаза отмены**) В противном случае экземпляр сообщает об ошибке, а все остальные экземпляры откатывают обновление: удаляют файл, если уже подготовили его.

source: (**Commit phase**) Upon successful preparation of all instances, the cluster commits the changes. Every instance:
ru: (**Фаза коммита**) После успешной подготовки всех экземпляров кластер фиксирует изменения. Каждый экземпляр:

source: Creates the active configuration's hard-link.
ru: Создает жесткую ссылку на активную конфигурацию.

source: Atomically replaces the active configuration file with the prepared one. The atomic replacement is indivisible -- it can either succeed or fail entirely, never partially.
ru: Атомарно заменяет активный файл конфигурации на подготовленный файл. Атомарная замена неделима: она выполняется или не выполняется полностью — но не частично.

source: Calls the ``apply_config()`` function of every registered role.
ru: Вызывает функцию ``apply_config()`` каждой зарегистрированной роли.

source: If any of these steps fail, an error pops up in the web interface next to the corresponding instance. The cluster does not handle such errors automatically, they require manual repair.
ru: Если любой из этих шагов не будет выполнен, в веб-интерфейсе появится ошибка рядом с соответствующим экземпляром. Кластер не обрабатывает такие ошибки автоматически, их необходимо исправлять вручную.

source: You will avoid the repair if the ``validate_config()`` function can detect all configuration problems that may lead to ``apply_config()`` errors.
ru: Такого рода исправлений можно избежать, если функция ``validate_config()`` сможет обнаружить все проблемы конфигурации, которые могут привести к ошибкам в ``apply_config()``.

source: Using the built-in HTTP server
ru: Использование встроенного HTTP-сервера

source: The cluster launches an ``httpd`` server instance during initialization (``cartridge.cfg()``). You can bind a port to the instance via an environmental variable:
ru: Кластер запускает экземпляр ``httpd``-сервера во время инициализации (``cartridge.cfg()``). Можно привязать порт к экземпляру через переменную окружения:

source: -- Get the port from an environmental variable or the default one: local http_port = os.getenv('HTTP_PORT') or '8080' local ok, err = cartridge.cfg({ ... -- Pass the port to the cluster: http_port = http_port, ... })
ru: -- Получите порт из переменной окружения или используйте значение по умолчанию: local http_port = os.getenv('HTTP_PORT') or '8080' local ok, err = cartridge.cfg({ ... -- Передайте порт кластеру: http_port = http_port, ... })

source: To make use of the ``httpd`` instance, access it and configure routes inside the ``init()`` function of some role, e.g. a role that exposes API over HTTP:
ru: Чтобы использовать ``httpd``-экземпляр, получите к нему доступ и настройте маршруты в рамках функции ``init()`` для какой-либо роли (например, для роли, которая предоставляет API через HTTP):

source: local function init(opts) ... -- Get the httpd instance: local httpd = cartridge.service_get('httpd') if httpd ~= nil then -- Configure a route to, for example, metrics: httpd:route({ method = 'GET', path = '/metrics', public = true, }, function(req) return req:render({json = stat.stat()}) end ) end end
ru: local function init(opts) ... -- Получите экземпляр httpd: local httpd = cartridge.service_get('httpd') if httpd ~= nil then -- Настройте маршрут, например к метрикам: httpd:route({ method = 'GET', path = '/metrics', public = true, }, function(req) return req:render({json = stat.stat()}) end ) end end

source: For more information on using Tarantool's HTTP server, see `its documentation <https://github.com/tarantool/http>`_.
ru: Чтобы получить дополнительную информацию об использовании HTTP-сервера Tarantool, обратитесь к `документации <https://github.com/tarantool/http>`_.

source: Implementing authorization in the web interface
ru: Реализация авторизации в веб-интерфейсе

source: To implement authorization in the web interface of every instance in a Tarantool cluster:
ru: Чтобы реализовать авторизацию в веб-интерфейсе для каждого экземпляра в кластере Tarantool:

source: Implement a new, say, ``auth`` module with a ``check_password`` function. It should check the credentials of any user trying to log in to the web interface.
ru: Используйте модуль, к примеру, ``auth`` с функцией ``check_password``. Данная функция проверяет учетные данные любого пользователя, который пытается войти в веб-интерфейс.

source: The ``check_password`` function accepts a username and password and returns an authentication success or failure.
ru: Функция ``check_password`` принимает имя пользователя и пароль и возвращает результат аутентификации: пройдена или нет.
