Repository: tarantool/cartridge
Catalog: rst/locale/*/LC_MESSAGES/cartridge_dev.po
Languages: ru

source: Developer's guide
ru: Руководство разработчика

source: For a quick start, skip the details below and jump right away to the `Cartridge getting started guide <https://www.tarantool.io/en/doc/latest/getting_started/getting_started_cartridge/>`_.
ru: Если вы хотите сразу приступить к работе, пропустите подробное описание ниже и переходите к `Руководству по началу работы с Cartridge <https://www.tarantool.io/en/doc/latest/getting_started/getting_started_cartridge/>`_.

source: For a deep dive into what you can develop with Tarantool Cartridge, go on with the Cartridge developer's guide.
ru: Чтобы тщательно изучить, какие возможности Tarantool Cartridge предоставляет для разработки приложений, продолжайте знакомиться с руководством для разработчика по Cartridge.

source: Introduction
ru: Введение

source: To develop and start an application, you need to go through the following steps:
ru: Чтобы разработать и запустить приложение, вам необходимо выполнить следующие шаги:

source: :ref:`Install <cartridge-install-dev>` Tarantool Cartridge and other components of the development environment.
ru: :ref:`Установить <cartridge-install-dev>` Tarantool Cartridge и другие компоненты среды разработки.

source: :ref:`Create a project <cartridge-project>`.
ru: :ref:`Создать проект <cartridge-project>`.

source: Develop the application. In case it is a cluster-aware application, implement its logic in a custom (user-defined) :ref:`cluster role <cartridge-roles>` to initialize the database in a cluster environment.
ru: Разработать приложение. Если это приложение с поддержкой кластеров, реализуйте его логику в виде отдельной (пользовательской) :ref:`кластерной роли <cartridge-roles>`, чтобы инициализировать базу данных в кластерной среде.

source: :ref:`Deploy <cartridge-deploy>` the application to target server(s). This includes :ref:`configuring <cartridge-config>` and :ref:`starting <cartridge-run>` the instance(s).
ru: :ref:`Развернуть <cartridge-deploy>` приложение на сервере или серверах. Это включает в себя :ref:`настройку <cartridge-config>` и :ref:`запуск <cartridge-run>` экземпляров.

source: In case it is a cluster-aware application, :ref:`deploy the cluster <cartridge-deployment>`.
ru: Если это приложение с поддержкой кластеров, :ref:`развернуть кластер <cartridge-deployment>`.

source: The following sections provide details for each of these steps.
ru: В следующих разделах подробно описывается каждый из этих шагов.

source: Installing Tarantool Cartridge
ru: Установка Tarantool Cartridge

source: `Install <https://github.com/tarantool/cartridge-cli#installation>`__ ``cartridge-cli``, a command-line tool for developing, deploying, and managing Tarantool applications.
ru: `Установите <https://github.com/tarantool/cartridge-cli#installation>`__ ``cartridge-cli`` — инструмент командной строки для разработки, развертывания и управления Tarantool-приложениями.

source: `Install <https://git-scm.com/book/en/v2/Getting-Started-Installing-Git>`__ ``git``, a version control system.
ru: `Установите <https://git-scm.com/book/en/v2/Getting-Started-Installing-Git>`__ ``git`` — систему управления версиями.

source: `Install <https://www.npmjs.com/get-npm>`__ ``npm``, a package manager for ``node.js``.
ru: `Установите <https://www.npmjs.com/get-npm>`__ ``npm`` — менеджер пакетов для ``node.js``.

source: `Install <https://linuxize.com/post/how-to-unzip-files-in-linux/>`__ the ``unzip`` utility.
ru: `Установите <https://linuxize.com/post/how-to-unzip-files-in-linux/>`__ утилиту ``unzip``.

source: Creating a project
ru: Создание проекта

source: To set up your development environment, create a project using the Tarantool Cartridge project template. In any directory, run:
ru: Чтобы настроить среду разработки, создайте проект по шаблону проекта Tarantool Cartridge. В любой директории выполните:

source: This will automatically set up a Git repository in a new ``/path/to/<app_name>/`` directory, tag it with :ref:`version <cartridge-versioning>` ``0.1.0``, and put the necessary files into it.
ru: При этом будет автоматически создан Git-репозиторий в новом каталоге ``/путь/к/<app_name>/`` с необходимыми файлами и проставленным :ref:`тегом версии <cartridge-versioning>` ``0.1.0``.

source: In this Git repository, you can develop the application (by simply editing the default files provided by the template), plug the necessary modules, and then easily pack everything to deploy on your server(s).
ru: В этом Git-репозитории можно разработать приложение (просто редактируя файлы из шаблона), подключить необходимые модули, а затем с легкостью упаковать всё для развертывания на своих серверах.

source: The project template creates the ``<app_name>/`` directory with the following contents:
ru: Шаблон проекта создает каталог ``<app_name>/``, который включает в себя:

source: ``<app_name>-scm-1.rockspec`` file where you can specify the application dependencies.
ru: файл ``<имя_приложения>-scm-1.rockspec``, где можно указать зависимости приложения.

source: ``deps.sh`` script that resolves dependencies from the ``.rockspec`` file.
ru: скрипт ``deps.sh``, который решает проблемы с зависимостями из файла ``.rockspec``.

source: ``init.lua`` file which is the entry point for your application.
ru: файл ``init.lua``, который является точкой входа в ваше приложение.

source: ``.git`` file necessary for a Git repository.
ru: файл ``.git``, необходимый для Git-репозитория.

source: ``.gitignore`` file to ignore the unnecessary files.
ru: файл ``.gitignore``, чтобы не учитывать ненужные файлы.

source: ``env.lua`` file that sets common rock paths so that the application can be started from any directory.
ru: файл ``env.lua``, который устанавливает общие пути для модулей, чтобы приложение можно было запустить из любого каталога.

source: ``custom-role.lua`` file that is a placeholder for a custom (user-defined) :ref:`cluster role <cartridge-roles>`.
ru: файл ``custom-role.lua``, который представляет собой объект-заполнитель для пользовательской :ref:`кластерной роли <cartridge-roles>`.

source: The entry point file (``init.lua``), among other things, loads the ``cartridge`` module and calls its initialization function:
ru: Файл входа в приложение (``init.lua``), в частности, загружает модуль ``cartridge`` и вызывает соответствующую функцию инициализации:

source: ... local cartridge = require('cartridge') ... cartridge.cfg({ -- cartridge options example workdir = '/var/lib/tarantool/app', advertise_uri = 'localhost:3301', cluster_cookie = 'super-cluster-cookie', ... }, { -- box options example memtx_memory = 1000000000, ... }) ...
ru: ... local cartridge = require('cartridge') ... cartridge.cfg({ -- пример настройки cartridge workdir = '/var/lib/tarantool/app', advertise_uri = 'localhost:3301', cluster_cookie = 'super-cluster-cookie', ... }, { -- пример настройки модуля box memtx_memory = 1000000000, ... }) ...

source: The ``cartridge.cfg()`` call renders the instance operable via the administrative console but does not call ``box.cfg()`` to configure instances.
ru: Вызов ``cartridge.cfg()`` позволяет управлять экземпляром через административную консоль, но не вызывает ``box.cfg()`` для настройки экземпляров.

source: Calling the ``box.cfg()`` function is forbidden.
ru: Запрещается вызывать функцию ``box.cfg()``.

source: The cluster itself will do it for you when it is time to:
ru: Сам кластер сделает это за вас, когда придет время:

source: bootstrap the current instance once you:
ru: загрузить текущий экземпляр, когда вы:

source: run ``cartridge.bootstrap()`` via the administrative console, or
ru: выполните ``cartridge.bootstrap()`` в административной консоли, или

source: click **Create** in the web interface;
ru: нажмете **Create** в веб-интерфейсе;

source: join the instance to an existing cluster once you:
ru: присоединить экземпляр к существующему кластеру, когда вы:

source: run ``cartridge.join_server({uri = 'other_instance_uri'})`` via the console, or
ru: выполните ``cartridge.join_server({uri = ''uri_другого_экземпляра'})`` в консоли, или

source: click **Join** (an existing replica set) or **Create** (a new replica set) in the web interface.
ru: нажмете **Join** (Присоединить -- к уже существующему набору реплик) или **Create** (Создать -- для нового набора реплик) в веб-интерфейсе.

source: Notice that you can specify a cookie for the cluster (``cluster_cookie`` parameter) if you need to run several clusters in the same network. The cookie can be any string value.
ru: Обратите внимание, что вы можете указать cookie для кластера (параметр ``cluster_cookie``), если необходимо запустить несколько кластеров в одной сети. Cookie может представлять собой любое строковое значение.

source: Now you can develop an application that will run on a single or multiple independent Tarantool instances (e.g. acting as a proxy to third-party databases) -- or will run in a cluster.
ru: Теперь можно разрабатывать приложение, которое будет работать на одном или нескольких независимых экземплярах Tarantool (например, в качестве прокси-сервера для сторонних баз данных) — или в кластере.

source: If you plan to develop a cluster-aware application, first familiarize yourself with the notion of :ref:`cluster roles <cartridge-roles>`.
ru: Если вы планируете разрабатывать приложение с поддержкой кластеров, сначала познакомьтесь с понятием :ref:`кластерных ролей <cartridge-roles>`.

source: Cluster roles
ru: Кластерные роли

source: **Cluster roles** are Lua modules that implement some specific functions and/or logic. In other words, a Tarantool Cartridge cluster segregates instance functionality in a role-based way.
ru: **Кластерные роли** — это Lua-модули, которые реализуют некоторые конкретные функции и/или логику. Другими словами, кластер Tarantool Cartridge распределяет функции экземпляров на основе ролей.

source: Since all instances running cluster applications use the same source code and are aware of all the defined roles (and plugged modules), you can dynamically enable and disable multiple different roles without restarts, even during cluster operation.
ru: Поскольку все экземпляры, выполняющие кластерные приложения, используют один и тот же исходный код и знают обо всех определенных ролях (и подключенных модулях), можно динамически включать и выключать несколько разных ролей без перезапусков даже во время работы кластера.

source: Note that every instance in a replica set performs the same roles and you cannot enable/disable roles individually on some instances. In other words, configuration of enabled roles is set up *per replica set*. See a step-by-step configuration example in :ref:`this guide <cartridge-deployment>`.
ru: Обратите внимание, что каждый экземпляр в наборе реплик выполняет одни и те же роли, и нельзя включить/выключить роли отдельно для какого-то экземпляра. Другими словами, роли включаются *для набора реплик*. Пошаговый пример настройки см. в :ref:`этом руководстве <cartridge-deployment>`.

source: Built-in roles
ru: Встроенные роли

source: The ``cartridge`` module comes with two *built-in* roles that implement automatic sharding:
ru: В модуль ``cartridge`` входят две *встроенные* роли, которые реализуют автоматический шардинг:

source: ``vshard-router`` that handles the ``vshard``'s *compute-intensive* workload: routes requests to storage nodes.
ru: ``vshard-router`` обрабатывает *ресурсоемкие* вычисления в ``vshard``: направляет запросы к узлам хранения данных.

source: ``vshard-storage`` that handles the ``vshard``'s *transaction-intensive* workload: stores and manages a subset of a dataset.
ru: ``vshard-storage`` работает с *большим количеством транзакций* в ``vshard``: хранит подмножество набора данных и управляет им.

source: For more information on sharding, see the `vshard module documentation <https://www.tarantool.io/en/doc/latest/reference/reference_rock/vshard/>`_.
ru: Для получения дополнительной информации о шардировании см. `документацию по модулю vshard <https://www.tarantool.io/en/doc/latest/reference/reference_rock/vshard/>`_.

source: With the built-in and :ref:`custom roles <cartridge-custom-roles>`, you can develop applications with separated compute and transaction handling -- and enable relevant workload-specific roles on different instances running on physical servers with workload-dedicated hardware.
ru: Благодаря встроенным и :ref:`пользовательским ролям <cartridge-custom-roles>` можно разрабатывать приложения, где обработка вычислений выполняется отдельно от обработки транзакций, а также включать кластерные роли в зависимости от рабочей нагрузки на экземпляры, которые работают на физических серверах с аппаратным обеспечением, предназначенным для рабочей нагрузки определенного типа.

source: Custom roles
ru: Пользовательские роли

source: You can implement custom roles for any purposes, for example:
ru: Вы можете создавать пользовательские роли для любых целей, например:

source: define stored procedures;
ru: определять хранимые процедуры;

source: implement extra features on top of ``vshard``;
ru: реализовать дополнительные функции на основе ``vshard``;

source: go without ``vshard`` at all;
ru: полностью обойтись без ``vshard``;

source: implement one or multiple supplementary services such as e-mail notifier, replicator, etc.
ru: внедрить одну или несколько дополнительных служб, таких как средство уведомления по электронной почте, репликатор и т.д.

source: To implement a custom cluster role, do the following:
ru: Чтобы реализовать пользовательскую кластерную роль, выполните следующие действия:

source: Take the ``app/roles/custom.lua`` file in your project as a sample. Rename this file as you wish, e.g. ``app/roles/custom-role.lua``, and implement the role's logic. For example:
ru: Возьмите в качестве примера файл ``app/roles/custom.lua`` из проекта. Переименуйте этот файл как угодно, например ``app/roles/custom-role.lua``, и опишите логику роли. Например:

source: -- Implement a custom role in app/roles/custom-role.lua local role_name = 'custom-role' local function init() ... end local function stop() ... end return { role_name = role_name, init = init, stop = stop, }
ru: -- Реализуйте пользовательскую роль в app/roles/custom-role.lua local role_name = 'custom-role' local function init() ... end local function stop() ... end return { role_name = role_name, init = init, stop = stop, }

source: Here the ``role_name`` value may differ from the module name passed to the ``cartridge.cfg()`` function. If the ``role_name`` variable is not specified, the module name is the default value.
ru: Здесь значение ``role_name`` может отличаться от имени модуля, переданного в функцию ``cartridge.cfg()``. Если не указать переменную ``role_name``, то значением по умолчанию будет имя модуля.

source: Role names must be unique as it is impossible to register multiple roles with the same name.
ru: Имена ролей должны быть уникальными, поскольку нельзя зарегистрировать несколько ролей с одним именем.

source: Register the new role in the cluster by modifying the ``cartridge.cfg()`` call in the ``init.lua`` entry point file:
ru: Зарегистрируйте новую роль в кластере, изменив вызов ``cartridge.cfg()`` в файле входа в приложение ``init.lua``:

source: -- Register a custom role in init.lua ... local cartridge = require('cartridge') ... cartridge.cfg({ workdir = ..., advertise_uri = ..., roles = {'custom-role'}, }) ...
ru: -- Зарегистрируйте пользовательскую роль в init.lua, ... local cartridge = require('cartridge') ... cartridge.cfg({ workdir = ..., advertise_uri = ..., roles = {'custom-role'}, }) ...

source: where ``custom-role`` is the name of the Lua module to be loaded.
ru: где ``custom-role`` — это название загружаемого Lua-модуля.

source: The role module does not have required functions, but the cluster may execute the following ones during the :ref:`role's life cycle <cartridge-role-lifecycle>`:
ru: В модуле роли нет необходимых функций, но в течение :ref:`жизненного цикла роли <cartridge-role-lifecycle>` кластер может выполнять следующие функции:

source: ``init()`` is the role's *initialization* function.
ru: ``init()`` -- это функция *инициализации* роли.

source: Inside the function's body you can call any `box <https://www.tarantool.io/en/doc/latest/reference/reference_lua/box/>`_ functions: create spaces, indexes, grant permissions, etc. Here is what the initialization function may look like:
ru: В пределах тела функции можно вызывать любые функции из `box <https://www.tarantool.io/en/doc/latest/reference/reference_lua/box/>`_: создавать спейсы, индексы, выдавать права и т.д. Вот как может выглядеть функция инициализации:

source: local function init(opts) -- The cluster passes an 'opts' Lua table containing an 'is_master' flag. if opts.is_master then local customer = box.schema.space.create('customer', { if_not_exists = true } ) customer:format({ {'customer_id', 'unsigned'}, {'bucket_id', 'unsigned'}, {'name', 'string'}, }) customer:create_index('customer_id', { parts = {'customer_id'}, if_not_exists = true, }) end end
ru: local function init(opts) -- Кластер передает Lua-таблицу 'opts', содержащую флаг 'is_master'. if opts.is_master then local customer = box.schema.space.create('customer', { if_not_exists = true } ) customer:format({ {'customer_id', 'unsigned'}, {'bucket_id', 'unsigned'}, {'name', 'string'}, }) customer:create_index('customer_id', { parts = {'customer_id'}, if_not_exists = true, }) end end

source: Neither ``vshard-router`` nor ``vshard-storage`` manage spaces, indexes, or formats. You should do it within a *custom* role: add a ``box.schema.space.create()`` call to your first cluster role, as shown in the example above.
ru: Спейсами, индексами и форматами не управляют ни ``vshard-router``, ни ``vshard-storage`` — это придется делать в рамках *пользовательской* роли, то есть добавить вызов ``box.schema.space.create()`` к первой кластерной роли, как показано в примере выше.

source: The function's body is wrapped in a conditional statement that lets you call ``box`` functions on masters only. This protects against replication collisions as data propagates to replicas automatically.
ru: Тело функции заключено в условный оператор, который позволяет вызывать функции ``box`` только на мастерах. Это предотвращает конфликты репликации, так как данные автоматически передаются на реплики.

source: ``stop()`` is the role's *termination* function. Implement it if initialization starts a fiber that has to be stopped or does any job that needs to be undone on termination.
ru: ``stop()`` — это функция *завершения работы* роли. Ее стоит использовать, если инициализация запускает файбер, который нужно остановить, или же выполняет любую задачу, которую нужно отменить при завершении работы.

source: ``validate_config()`` and ``apply_config()`` are functions that *validate* and *apply* the role's configuration. Implement them if some configuration data needs to be stored cluster-wide.
ru: ``validate_config()`` и ``apply_config()`` — это функции, которые *валидируют* и *применяют* настройки роли соответственно. Их стоит использовать, если какие-то настройки нужно хранить на уровне кластера.

source: Next, get a grip on the :ref:`role's life cycle <cartridge-role-lifecycle>` to implement the functions you need.
ru: Далее, изучите :ref:`жизненный цикл ролей <cartridge-role-lifecycle>`, чтобы реализовать необходимые функции.

source: Defining role dependencies
ru: Определение зависимостей для ролей

source: You can instruct the cluster to apply some other roles if your custom role is enabled.
ru: Можно заставить кластер применить некоторые другие роли, если включена пользовательская роль.

source: For example:
ru: Например:

source: -- Role dependencies defined in app/roles/custom-role.lua local role_name = 'custom-role' ... return { role_name = role_name, dependencies = {'cartridge.roles.vshard-router'}, ... }
ru: -- Зависимости для ролей, определенные в app/roles/custom-role.lua local role_name = 'custom-role' ... return { role_name = role_name, dependencies = {'cartridge.roles.vshard-router'}, ... }

source: Here ``vshard-router`` role will be initialized automatically for every instance with ``custom-role`` enabled.
ru: Здесь роль ``vshard-router`` будет инициализирована автоматически для каждого экземпляра, в котором включена роль ``custom-role``.

source: Using multiple vshard storage groups
ru: Использование нескольких групп vshard storage

source: Replica sets with ``vshard-storage`` roles can belong to different *groups*. For example, ``hot`` or ``cold`` groups meant to independently process hot and cold data.
ru: Для наборов реплик с ролью ``vshard-storage`` можно задавать *группы*. Например, группы ``hot`` и ``cold`` предназначены для независимой обработки горячих и холодных данных.

source: Groups are specified in the cluster's configuration:
ru: Группы указаны в конфигурации кластера:

source: -- Specify groups in init.lua cartridge.cfg({ vshard_groups = {'hot', 'cold'}, ... })
ru: -- Укажите группы в init.lua cartridge.cfg({ vshard_groups = {'hot', 'cold'}, ... })

source: If no groups are specified, the cluster assumes that all replica sets belong to the ``default`` group.
ru: Если ни одна группа не указана, кластер предполагает, что все наборы реплик входят в группу ``default`` (по умолчанию).

source: With multiple groups enabled, every replica set with a ``vshard-storage`` role enabled must be assigned to a particular group. The assignment can never be changed.
ru: Если включены несколько групп, каждый набор реплик с включенной ролью ``vshard-storage`` должен быть назначен в определенную группу. Эту настройку нельзя изменить впоследствии.

source: Another limitation is that you cannot add groups dynamically (this will become available in future).
ru: Есть еще одно ограничение -- нельзя добавлять группы динамически (такая возможность появится в будущих версиях).

source: Finally, mind the syntax for router access. Every instance with a ``vshard-router`` role enabled initializes multiple routers. All of them are accessible through the role:
ru: Наконец, обратите внимание на синтаксис для доступа к роутеру. Каждый экземпляр со включенной ролью ``vshard-router`` инициализирует несколько роутеров. Доступ к ним можно получить через роль:

source: If you have no roles specified, you can access a static router as before (when Tarantool Cartridge was unaware of groups):
ru: Если роли не указаны, доступ к статическому роутеру можно получить, как и прежде (когда Tarantool Cartridge не знал о группах):

source: However, when using the current group-aware API, you must call a static router with a colon:
ru: Тем не менее, при использовании действующего API, работающего с группами, статический роутер следует вызывать при помощи двоеточия:

source: local router_role = cartridge.service_get('vshard-router') local default_router = router_role.get() -- or router_role.get('default') default_router:call(...)
ru: local router_role = cartridge.service_get('vshard-router') local default_router = router_role.get() -- или router_role.get('default') default_router:call(...)

source: Role's life cycle (and the order of function execution)
ru: Жизненный цикл роли и порядок выполнения функций
