Repository: tarantool/cartridge
Catalog: rst/locale/*/LC_MESSAGES/cartridge_dev.po
Languages: ru

source: If replication is stuck and consistent promotion isn't possible, a user has two options: to revert promotion (to re-promote the old leader) or to force it inconsistently (all kinds of ``failover_promote`` API has ``force_inconsistency`` flag).
ru: Если репликация застряла и последовательное продвижение невозможно, у пользователя есть два варианта: отменить продвижение (снова продвинуть старого лидера) или вызвать недопустимое состояние (во всех видах API ``failover_promote`` есть флаг для вызова недопустимого состояния ``force_inconsistency``).

source: Consistent promotion doesn't work for replicasets with `all_rw` flag enabled and for single-instance replicasets. In these two cases an instance doesn't even try to query `vclockkeeper` and to perform `wait_lsn`. But the coordinator still appoints a new leader if the current one dies.
ru: Последовательное продвижение не работает для наборов реплик с установленным флагом `all_rw` и для наборов реплик из одного экземпляра. В этих случаях экземпляр даже не пытается запросить `vclockkeeper` и выполнить `wait_lsn`. Но координатор все равно назначает нового лидера, если текущий будет недоступен.

source: Fencing
ru: Фенсинг

source: Neither ``eventual`` nor ``stateful`` failover mode protects a replicaset from the presence of multiple leaders when the network is partitioned. But fencing does. It enforces at-most-one leader policy in a replicaset.
ru: Ни режим ``eventual``, ни режим ``stateful`` не защищают набор реплик от появления нескольких лидеров, когда сеть разделена. А фенсинг (изоляция узла, fencing) защищает, обеспечивая соблюдение требования о наличии не более одного лидера в наборе реплик.

source: Fencing operates as a fiber that occasionally checks connectivity with the state provider and with replicas. Fencing fiber runs on vclockkeepers; it starts right after consistent promotion succeeds. Replicasets which don't need consistency (single-instance and ``all_rw``) don't defense, though.
ru: Изоляция представляет собой файбер, который время от времени проверяет связь с поставщиком состояния и с репликами. Файбер изоляции работает на экземплярах vclockkeeper; он запускается сразу, когда подтверждается последовательное продвижение. Изоляция не применяется к наборам реплик, которым не нужна консистентность (с одним экземпляром и ``all_rw``).

source: The condition for fencing actuation is the loss of both the state provider quorum and at least one replica. Otherwise, if either state provider is healthy or all replicas are alive, the fencing fiber waits and doesn't intervene.
ru: Чтобы фенсинг сработал, должны выполняться такие условия: потеря кворума поставщика состояния и потеря хотя бы одной реплики. В противном случае, если либо поставщик состояния доступен, либо все реплики работают, файбер фенсинга ждет и не вмешивается в их работу.

source: When fencing is actuated, it generates a fake appointment locally and sets the leader to ``nil``. Consequently, the instance becomes read-only. Subsequent recovery is only possible when the quorum reestablishes; replica connection isn't a must for recovery. Recovery is performed according to the rules of consistent switchover unless some other instance has already been promoted to a new leader.
ru: Когда фенсинг срабатывает, он локально фиктивно назначает лидера на ``nil``. Следовательно, экземпляр будет доступен только для чтения. Возврат статуса лидера возможен только при восстановлении кворума; подключение реплики не будет обязательным условием, чтобы вернуть статус лидера. Экземпляр может снова стать лидером в соответствии с правилами последовательного переключения, если только какой-либо другой экземпляр еще не был назначен новым лидером.

source: Failover configuration
ru: Конфигурация восстановления после отказа

source: These are clusterwide parameters:
ru: Параметры конфигурации на уровне кластера:

source: ``failover_timeout`` -- time (in seconds) to mark ``suspect`` members as ``dead`` and trigger failover (default: 20).
ru: ``failover_timeout`` -- время (в секундах) до перевода члена кластера в статусе ``suspect`` в статус ``dead`` и запуска восстановления после отказа (по умолчанию: 20).

source: ``fencing_enabled``: ``true`` / ``false`` (default: false).
ru: ``fencing_enabled``: ``true`` / ``false`` (по умолчанию: false).

source: ``fencing_timeout`` -- time to actuate fencing after the check fails (default: 10).
ru: ``fencing_timeout`` -- время до срабатывания фенсинга после неудачной проверки (по умолчанию: 10).

source: ``fencing_pause`` -- the period of performing the check (default: 2).
ru: ``fencing_pause`` -- время на выполнение проверки (по умолчанию: 2).

source: It's required that ``failover_timeout > fencing_timeout >= fencing_pause``.
ru: Должно быть так: ``failover_timeout > fencing_timeout >= fencing_pause``.

source: See:
ru: См.:

source: Use your favorite GraphQL client (e.g. `Altair <https://altair.sirmuel.design/>`_) for requests introspection:
ru: Используйте ваш любимый клиент GraphQL (например, `Altair <https://altair.sirmuel.design/>`_) для интроспекции запросов:

source: Stateboard configuration
ru: Конфигурация stateboard

source: Like other Cartridge instances, the stateboard supports ``cartridge.argprase`` options:
ru: Как и другие экземпляры Cartridge, stateboard поддерживает параметры ``cartridge.argprase``:

source: Similarly to other ``argparse`` options, they can be passed via command-line arguments or via environment variables, e.g.:
ru: Как и другие параметры ``argparse``, их можно передавать как аргументы командной строки или переменные окружения, например:

source: Fine-tuning failover behavior
ru: Настройка поведения при восстановлении после отказа

source: Besides failover priority and mode, there are some other private options that influence failover operation:
ru: Помимо приоритета и режима восстановления после отказа, есть еще несколько закрытых параметров, которые влияют на восстановление после отказа:

source: ``LONGPOLL_TIMEOUT`` (``failover``) -- the long polling timeout (in seconds) to fetch new appointments (default: 30);
ru: ``LONGPOLL_TIMEOUT`` (``failover``) -- время ожидания длинного запроса (в секундах) для получения данных о назначении лидера (по умолчанию: 30);

source: ``NETBOX_CALL_TIMEOUT`` (``failover/coordinator``) -- stateboard client's connection timeout (in seconds) applied to all communications (default: 1);
ru: ``NETBOX_CALL_TIMEOUT`` (``failover/coordinator``) -- время ожидания соединения клиента stateboard (в секундах), применяется ко всем соединениям (по умолчанию: 1);

source: ``RECONNECT_PERIOD`` (``coordinator``) -- time (in seconds) to reconnect to the state provider if it's unreachable (default: 5);
ru: ``RECONNECT_PERIOD`` (``coordinator``) -- время (в секундах) для повторного соединения с поставщиком состояния, если он недоступен (по умолчанию: 5);

source: ``IMMUNITY_TIMEOUT`` (``coordinator``) -- minimal amount of time (in seconds) to wait before overriding an appointment (default: 15).
ru: ``IMMUNITY_TIMEOUT`` (``coordinator``) -- минимальное время (в секундах) до переназначения лидера (по умолчанию: 15).

source: Configuring instances
ru: Конфигурация экземпляров

source: Cartridge orchestrates a distributed system of Tarantool instances -- a cluster. One of the core concepts is **clusterwide configuration**. Every instance in a cluster stores a copy of it.
ru: Cartridge организует кластер — распределенную систему экземпляров Tarantool. Одно из основных понятий — **конфигурация на уровне кластера**. Каждый экземпляр в кластере хранит свою копию конфигурации.

source: Clusterwide configuration contains options that must be identical on every cluster node, such as the topology of the cluster, failover and vshard configuration, authentication parameters and ACLs, and user-defined configuration.
ru: В конфигурации на уровне кластера заданы параметры, которые должны быть одинаковыми на каждом узле кластера: топология кластера, конфигурация восстановления после отказа и настройки vshard, параметры аутентификации и ACL, а также настройки, которые задает пользователь.

source: Clusterwide configuration doesn't provide instance-specific parameters: ports, workdirs, memory settings, etc.
ru: В конфигурации на уровне кластера не задаются параметры для конкретного экземпляра: порты, рабочие каталоги, настройки памяти и т. д.

source: Configuration basics
ru: Основы конфигурации

source: Instance configuration includes two sets of parameters:
ru: Конфигурация экземпляра состоит из двух наборов параметров:

source: :ref:`cartridge.cfg() parameters <cartridge.argparse.cluster_opts>`;
ru: :ref:`параметры cartridge.cfg() <cartridge.argparse.cluster_opts>`;

source: :ref:`box.cfg() parameters <cartridge.argparse.box_opts>`.
ru: :ref:`параметры box.cfg() <cartridge.argparse.box_opts>`.

source: You can set any of these parameters in:
ru: Задать эти параметры можно:

source: Command line arguments.
ru: В аргументах в командной строке.

source: Environment variables.
ru: В переменных окружения.

source: YAML configuration file.
ru: В конфигурационном файле формата YAML.

source: ``init.lua`` file.
ru: В файле ``init.lua``.

source: The order here indicates the priority: command-line arguments override environment variables, and so forth.
ru: Вышеуказанный порядок определяет приоритет: аргументы в командной строке замещают переменные окружения и т.д.

source: No matter how you :ref:`start the instances <cartridge-run>`, you need to set the following ``cartridge.cfg()`` parameters for each instance:
ru: Независимо от того, как вы :ref:`запускаете экземпляры <cartridge-run>`, необходимо задать следующие параметры ``cartridge.cfg()`` для каждого экземпляра:

source: ``advertise_uri`` -- either ``<HOST>:<PORT>``, or ``<HOST>:``, or ``<PORT>``. Used by other instances to connect to the current one. **DO NOT** specify ``0.0.0.0`` -- this must be an external IP address, not a socket bind.
ru: ``advertise_uri`` -- либо ``<ХОСТ>:<ПОРТ>``, либо ``<ХОСТ>:``, либо ``<ПОРТ>``. Используется другими экземплярами для подключения. **НЕ** указывайте ``0.0.0.0`` -- это должен быть внешний IP-адрес, а не привязка сокета.

source: ``http_port`` -- port to open administrative web interface and API on. Defaults to ``8081``. To disable it, specify ``"http_enabled": False``.
ru: ``http_port`` -- порт, который используется, чтобы открывать административный веб-интерфейс и API. По умолчанию: ``8081``. Чтобы отключить, укажите ``"http_enabled": False``.

source: ``workdir`` -- a directory where all data will be stored: snapshots, wal logs, and ``cartridge`` configuration file. Defaults to ``.``.
ru: ``workdir`` — каталог, где хранятся все данные: файлы снимка, журналы упреждающей записи и конфигурационный файл ``cartridge``. По умолчанию: ``.``.

source: If you start instances using ``cartridge`` CLI or ``systemctl``, save the configuration as a YAML file, for example:
ru: Если вы запустите экземпляры, используя интерфейс командной строки ``cartridge`` или ``systemctl``, сохраните конфигурацию в формате YAML, например:

source: With ``cartridge`` CLI, you can pass the path to this file as the ``--cfg`` command-line argument to the ``cartridge start`` command -- or specify the path in ``cartridge`` CLI configuration (in ``./.cartridge.yml`` or ``~/.cartridge.yml``):
ru: С помощью интерфейса командной строки ``cartridge`` вы можете передать путь к этому файлу в качестве аргумента командной строки ``--cfg`` для команды ``cartridge start`` -- или же указать путь в конфигурации ``cartridge`` (в ``./.cartridge.yml`` или ``~/.cartridge.yml``):

source: With ``systemctl``, save the YAML file to ``/etc/tarantool/conf.d/`` (the default ``systemd`` path) or to a location set in the ``TARANTOOL_CFG`` environment variable.
ru: С помощью ``systemctl`` сохраните файл в формате YAML в ``/etc/tarantool/conf.d/`` (по умолчанию путь ``systemd``) или в место, указанное в переменной окружения ``TARANTOOL_CFG``.

source: If you start instances with ``tarantool init.lua``, you need to pass other configuration options as command-line parameters and environment variables, for example:
ru: Если вы запускаете экземпляры с помощью ``tarantool init.lua``, необходимо также передать другие параметры конфигурации в качестве параметров командной строки и переменных окружения, например:

source: Internal representation of clusterwide configuration
ru: Внутреннее представление конфигурации на уровне кластера

source: In the file system, clusterwide configuration is represented by a **file tree**. Inside ``workdir`` of any configured instance you can find the following directory:
ru: В файловой системе конфигурация на уровне кластера показана в виде **дерева файлов**. В ``workdir`` любого сконфигурированного экземпляра можно найти каталог:

source: This is the clusterwide configuration with three default **config sections** -- ``auth``, ``topology``, and ``vshard_groups``.
ru: Это конфигурация на уровне кластера с тремя **разделами config** по умолчанию: ``auth``, ``topology`` и ``vshard_groups``.

source: Due to historical reasons clusterwide configuration has two appearances:
ru: Исторически сложилось так, что есть два вида кластерной конфигурация:

source: old-style single-file ``config.yml`` with all sections combined, and
ru: один файл ``config.yml`` старого образца, в котором находятся все разделы, и

source: modern multi-file representation mentioned above.
ru: представленное выше современное представление из нескольких файлов.

source: Before cartridge v2.0 it used to look as follows, and this representation is still used in HTTP API and ``luatest`` helpers.
ru: Так конфигурация выглядела до версии Cartridge 2.0 и до сих используется в таком виде в HTTP API и вспомогательных утилитах ``luatest``:

source: Beyond these essential sections, clusterwide configuration may be used for storing some other role-specific data. Clusterwide configuration supports YAML as well as plain text sections. It can also be organized in nested subdirectories.
ru: Помимо основных разделов, в конфигурации на уровне кластера можно хранить некоторые другие данные для конкретной роли. Конфигурация на уровне кластера поддерживает YAML, а также обычные текстовые разделы. Используя вложенные подкаталоги, можно упорядочить разделы.

source: In Lua it's represented by the ``ClusterwideConfig`` object (a table with metamethods). Refer to the ``cartridge.clusterwide-config`` module documentation for more details.
ru: В Lua конфигурация представлена в виде объекта ``ClusterwideConfig`` (таблица с метаметодами). Для получения более подробной информации обратитесь к документации модуля ``cartridge.clusterwide-config``.

source: Two-phase commit
ru: Двухфазная фиксация транзакций

source: Cartridge manages clusterwide configuration to be identical everywhere using the two-phase commit algorithm implemented in the ``cartridge.twophase`` module. Changes in clusterwide configuration imply applying it on every instance in the cluster.
ru: Конфигурация на уровне кластера в Cartridge одинакова для всех экземпляров, что достигается использованием двухфазного алгоритма фиксации транзакций, который реализован в модуле ``cartridge.twophase``. Изменения в конфигурации на уровне кластера подразумевают применение этих изменений к каждому экземпляру в кластере.

source: Almost every change in cluster parameters triggers a two-phase commit: joining/expelling a server, editing replica set roles, managing users, setting failover and vshard configuration.
ru: Почти каждое изменение параметров кластера вызывает двухфазную фиксацию: присоединение/исключение сервера, редактирование ролей наборов реплик, управление пользователями, настройка восстановления после отказа и конфигурация vshard.

source: Two-phase commit requires all instances to be alive and healthy, otherwise it returns an error.
ru: Для двухфазной фиксации необходимо, чтобы все экземпляры были исправными и в статусе alive, иначе вернется ошибка.

source: For more details, please, refer to the ``cartridge.config_patch_clusterwide`` API reference.
ru: Для получения более подробной информации, обратитесь к справочнику по API ``cartridge.config_patch_clusterwide``.

source: Managing role-specific data
ru: Управление данными по конкретной роли

source: Beside system sections, clusterwide configuration may be used for storing some other **role-specific data**. It supports YAML as well as plain text sections. And it can also be organized in nested subdirectories.
ru: Помимо системных разделов, в конфигурации на уровне кластера можно хранить некоторые другие **данные для конкретной роли**. Конфигурация поддерживает YAML, а также обычные текстовые разделы. Используя вложенные подкаталоги, можно упорядочить разделы.

source: Role-specific sections are used by some third-party roles, i.e. `sharded-queue <https://github.com/tarantool/sharded-queue>`_ and `cartridge-extensions <https://github.com/tarantool/cartridge-extensions>`_.
ru: Некоторые сторонние роли (например, `sharded-queue <https://github.com/tarantool/sharded-queue>`_ и `cartridge-extensions <https://github.com/tarantool/cartridge-extensions>`_ также могут использовать такие разделы для конкретных ролей.

source: A user can influence clusterwide configuration in various ways. You can alter configuration using Lua, HTTP or GraphQL API. Also there are `luatest <https://github.com/tarantool/luatest>`_ helpers available.
ru: Конфигурацию на уровне кластера можно изменять различными способами. Вносить изменения можно с помощью API для Lua, HTTP или GraphQL. Кроме того, есть вспомогательные утилиты `luatest <https://github.com/tarantool/luatest>`_.

source: It works with old-style single-file representation only. It's useful when there are only few sections needed.
ru: Этот API работает только с одним файлом конфигурации старого образца, что полезно, когда нужны всего несколько разделов.

source: Example:
ru: Пример:

source: Upload new config:
ru: Загрузка новой конфигурации:

source: Download it:
ru: Скачивание конфигурации:

source: It's suitable for role-specific sections only. System sections (``topology``, ``auth``, ``vshard_groups``, ``users_acl``) can be neither uploaded nor downloaded.
ru: Скачивать можно только разделы для ролей. Системные разделы (``topology``, ``auth``, ``vshard_groups``, ``users_acl``) нельзя ни загружать, ни скачивать.

source: If authorization is enabled, use the ``curl`` option ``--user username:password``.
ru: Если включена авторизация, следует использовать параметр ``curl``: ``--user username:password``.

source: GraphQL API, by contrast, is only suitable for managing plain-text sections in the modern multi-file appearance. It is mostly used by WebUI, but sometimes it's also helpful in tests:
ru: В свою очередь, GraphQL API подходит только для управления раздела с простым текстом в современном виде конфигурации с множеством файлов. В основном этот API используется в веб-интерфейсе, но иногда и в тестах:

source: Unlike HTTP API, GraphQL affects only the sections mentioned in the query. All the other sections remain unchanged.
ru: В отличие от HTTP API, GraphQL API изменяет только те разделы, которые указаны в запросе. Остальные разделы остаются без изменений.

source: Similarly to HTTP API, GraphQL ``cluster {config}`` query isn't suitable for managing system sections.
ru: Как и HTTP API, запрос GraphQL ``cluster {config}`` не подойдет для управления системными разделами.

source: It's not the most convenient way to configure third-party role, but it may be useful for role development. Please, refer to the corresponding API reference:
ru: Это не самый удобный способ настройки сторонних ролей, но для разработки ролей он может быть полезен. Обратите внимание на соответствующий справочник по API:

source: Example (from ``sharded-queue``, simplified):
ru: Упрощенный пример (из ``sharded-queue``):

source: function create_tube(tube_name, tube_opts) local tubes = cartridge.config_get_deepcopy('tubes') or {} tubes[tube_name] = tube_opts or {} return cartridge.config_patch_clusterwide({tubes = tubes}) end local function validate_config(conf) local tubes = conf.tubes or {} for tube_name, tube_opts in pairs(tubes) do -- validate tube_opts end return true end local function apply_config(conf, opts) if opts.is_master then local tubes = cfg.tubes or {} -- create tubes according to the configuration end return true end
ru: function create_tube(tube_name, tube_opts) local tubes = cartridge.config_get_deepcopy('tubes') or {} tubes[tube_name] = tube_opts or {} return cartridge.config_patch_clusterwide({tubes = tubes}) end local function validate_config(conf) local tubes = conf.tubes or {} for tube_name, tube_opts in pairs(tubes) do -- валидируйте tube_opts end return true end local function apply_config(conf, opts) if opts.is_master then local tubes = cfg.tubes or {} -- создайте tubes в соответствии с конфигурацией end return true end

source: Luatest helpers
ru: Вспомогательные утилиты Luatest

source: Cartridge test helpers provide methods for configuration management:
ru: В Cartridge есть вспомогательные утилиты для тестирования, которые предлагают методы управления настройками:

source: Internally they wrap the HTTP API.
ru: Они реализованы путем оборачивания HTTP API.

source: Deploying an application
ru: Развертывание приложения

source: After you've developed your Tarantool Cartridge application locally, you can deploy it to a test or production environment.
ru: После того, как вы локально разработали приложение на Tarantool Cartridge, вы можете развернуть его в тестовой или производственной среде.

source: Deploying includes:
ru: Развертывание включает в себя:

source: packing the application into a specific distribution format
ru: упаковку приложения в специальный формат дистрибутива;

source: installing it to the target server
ru: установку его на целевой сервер;

source: running the application.
ru: запуск приложения.

source: You have four options to deploy a Tarantool Cartridge application:
ru: Развернуть приложение на Tarantool Cartridge можно четырьмя способами:

source: as an :ref:`RPM <cartridge-deploy-rpm>` package (for production)
ru: в виде :ref:`RPM <cartridge-deploy-rpm>`-пакета (для производственной среды);

source: as a :ref:`DEB <cartridge-deploy-deb>` package (for production)
ru: в виде :ref:`DEB <cartridge-deploy-deb>`-пакета (для производственной среды);

source: as a :ref:`tar+gz <cartridge-deploy-tgz>` archive (for testing or as a workaround for production if root access is unavailable)
ru: в виде архива :ref:`tar.gz <cartridge-deploy-tgz>` (для тестирования или как обходной путь для производственной среды, если отсутствует доступ уровня root);

source: :ref:`from sources <cartridge-deploy-rock>` (for local testing only).
ru: :ref:`из исходных файлов <cartridge-deploy-rock>` (только для локального тестирования).

source: Deploying as an RPM or DEB package
ru: Развертывание приложения в виде RPM- или DEB-пакета

source: The choice between DEB and RPM depends on the package manager of the target OS. DEB is used for Debian Linux and its derivatives, and RPM—for CentOS/RHEL and other RPM-based `Linux distributions <https://en.wikipedia.org/wiki/List_of_Linux_distributions>`_.
ru: Выбор между DEB- и RPM-пакетами зависит от пакетного менеджера целевой ОС. DEB используется для Debian Linux и его производных, а RPM — для CentOS/RHEL и других основанных на RPM `дистрибутивов Linux <https://en.wikipedia.org/wiki/List_of_Linux_distributions>`_.

source: If you use the `Tarantool Community Edition <https://www.tarantool.io/en/developers/>`_ while packing the application, the package will have a dependency on this version of Tarantool.
ru: Если при упаковке приложения вы используете `Tarantool Community Edition <https://www.tarantool.io/en/developers/>`_, то эта версия Tarantool будет среди зависимостей приложения.
