Repository: tarantool/cartridge
Catalog: rst/locale/*/LC_MESSAGES/cartridge_dev.po
Languages: ru

source: Note that ``errors.pcall`` API differs from the vanilla Lua `pcall <https://www.lua.org/pil/8.4.html>`_. Instead of ``true`` the former returns values returned from the call. If there is an error, it returns ``nil`` instead of ``false``, plus an error message.
ru: Обратите внимание, что API ``errors.pcall`` отличается от ванильного `pcall <https://www.lua.org/pil/8.4.html>`_ в Lua. Вместо ``true`` первый возвращает значения, полученные в результате вызова. Если произошла ошибка, то вместо ``false`` вернется ``nil`` и сообщение об ошибке.

source: Remote ``net.box`` calls keep no stack trace from the remote. In that case, ``errors.netbox_eval`` comes to the rescue. It will find a stack trace from local and remote hosts and restore metatables.
ru: Удаленные вызовы ``net.box`` не сохраняют трассировку стека от удаленного устройства. В этом случае на помощь придет ``errors.netbox_eval``. Он найдет трассировку стека с локального и удаленного хостов и восстановит метатаблицы.

source: However, ``vshard`` implemented in Tarantool doesn't utilize the ``errors`` module. Instead it uses `its own errors <https://github.com/tarantool/vshard/blob/master/vshard/error.lua>`_. Keep this in mind when working with ``vshard`` functions.
ru: Тем не мене, реализованный в Tarantool ``vshard`` не использует модуль ``errors``. Вместо этого он использует `собственные ошибки <https://github.com/tarantool/vshard/blob/master/vshard/error.lua>`_. Имейте это в виду при работе с функциями ``vshard``.

source: Data included in an error object (class name, message, traceback) may be easily converted to string using the ``tostring()`` function.
ru: Данные, включенные в объект ошибки (имя класса, сообщение, обратная трассировка), можно легко преобразовать в строку с помощью функции ``tostring()``.

source: GraphQL implementation in Cartridge wraps the ``errors`` module, so a typical error response looks as follows:
ru: В реализации GraphQL в Cartridge оборачивается модуль ``errors``, поэтому обычно ответ на ошибку выглядит следующим образом:

source: Read more about errors in the `GraphQL specification <http://spec.graphql.org/draft/#sec-Errors.Error-result-format>`_.
ru: Подробнее об ошибках читайте в `спецификации GraphQL <http://spec.graphql.org/draft/#sec-Errors.Error-result-format>`_.

source: If you're going to implement a GraphQL handler, you can add your own extension like this:
ru: Если вы собираетесь реализовать обработчик GraphQL, то можете добавить свое расширение таким образом:

source: It will lead to the following response:
ru: Ответ будет таким:

source: In a nutshell, an ``errors`` object is a table. This means that it can be swiftly represented in JSON. This approach is used by Cartridge to handle errors via http:
ru: Если кратко, то объект ``errors`` представляет собой таблицу, то есть его можно быстро представить в JSON. В Cartridge это используется для обработки ошибок через HTTP:

source: Cluster instance lifecycle
ru: Жизненный цикл кластера

source: Every instance in the cluster has an internal state machine. It helps manage cluster operation and describe a distributed system simpler.
ru: Каждый экземпляр в кластере имеет встроенную машину состояний (state machine, конечный автомат). Это помогает управлять работой кластера и позволяет упростить описание распределенной системы.

source: Instance lifecycle starts with a ``cartridge.cfg`` call. During the initialization, Cartridge instance binds TCP (iproto) and UDP sockets (SWIM), checks working directory. Depending on the result, it enters one of the following states:
ru: Жизненный цикл экземпляра начинается с вызова ``cartridge.cfg``. Во время инициализации экземпляр Cartridge привязывает TCP- (iproto) и UDP-сокеты (SWIM) и проверяет рабочую директорию. В зависимости от результата экземпляр переходит в одно из следующих состояний:

source: If the working directory is clean and neither snapshots nor cluster-wide configuration files exist, the instance enters the ``Unconfigured`` state.
ru: Если рабочая директория пуста и для экземпляра не обнаружено ни снимков данных, ни конфигурации на уровне кластера, экземпляр переходит в состояние ``Unconfigured``.

source: The instance starts to accept iproto requests (Tarantool binary protocol) and remains in the state until the user decides to join it to a cluster (to create replicaset or join an existing one).
ru: Экземпляр начинает принимать запросы iproto (бинарный протокол Tarantool) и остается в этом состоянии до тех пор, пока пользователь не решит присоединить его к кластеру — создать набор реплик или присоединиться к существующему.

source: After that, the instance moves to the ``BootstrappingBox`` state.
ru: После этого экземпляр переходит в состояние ``BootstrappingBox``.

source: If the instance finds all configuration files and snapshots, it enters the ``ConfigFound`` state. The instance does not load the files and snapshots yet, because it will download and validate the config first. On success, the state enters the ``ConfigLoaded`` state. On failure, it will move to the ``InitError`` state.
ru: Если экземпляр обнаружил все конфигурационные файлы и снимки данных, он переходит в состояние ``ConfigFound``. Экземпляр пока не загружает файлы и снимки, поскольку вначале необходимо загрузить и проверить конфигурацию. В случае успеха экземпляр переходит в состояние ``ConfigLoaded``, в противном случае состояние изменится на ``InitError``.

source: Config is found, loaded and validated. The next step is instance configuring. If there are any snapshots, the instance will change its state to ``RecoveringSnapshot``. Otherwise, it will move to ``BootstrappingBox`` state. By default, all instances start in read-only mode and don’t start listening until bootstrap/recovery finishes.
ru: Файл конфигурации был найден, загружен и проверен. Следующий шаг — конфигурация экземпляра. Если были обнаружены прошлые снимки данных, состояние экземпляра изменится на ``RecoveringSnapshot``. В противном случае экземпляр перейдет в состояние ``BootstrappingBox``. По умолчанию все экземпляры запускаются в режиме только для чтения и не принимают запросы до завершения загрузки или восстановления.

source: The following events can cause instance initialization error:
ru: Ошибка инициализации экземпляра может быть вызвана следующими событиями:

source: Error occurred during ``cartridge.remote-control``’s connection to binary port
ru: Возникла ошибка во время соединения ``cartridge.remote-control`` с бинарным портом;

source: Missing ``config.yml`` from workdir (``tmp/``), while snapshots are present
ru: В рабочей директории (``tmp/``) отсутствует ``config.yml``, хотя снимки данных есть;

source: Error while loading configuration from disk
ru: Ошибка при загрузке конфигурации с диска;

source: Invalid config - Server is not present in the cluster configuration
ru: Некорректная конфигурация: в конфигурации кластера отсутствует сервер.

source: Configuring arguments for ``box.cfg`` if snapshots or config files are not present. ``box.cfg`` execution. Setting up users and stopping ``remote-control``. The instance will try to start listening to full-featured iproto protocol. In case of failed attempt instance will change its state to ``BootError``. On success, the instance enters the ``ConnectingFullmesh`` state. If there is no replicaset in cluster-wide config, the instance will set the state to ``BootError``.
ru: Если снимки данных или файлы конфигурации отсутствуют, выполняется настройка аргументов для ``box.cfg``, затем выполняется сам ``box.cfg``. Также на этом этапе происходит настройка пользователей и остановка ``remote-control``. Экземпляр попытается начать прослушивать полнофункциональный протокол iproto. В случае неудачной попытки экземпляр изменит свое состояние на ``BootError``. Если всё в порядке, экземпляр примет состояние ``ConnectingFullmesh``. Если в конфигурации на уровне кластера нет набора реплик, экземпляр также перейдет в состояние ``BootError``.

source: If snapshots are present, ``box.cfg`` will start a recovery process. After that, the process is similar to ``BootstrappingBox``.
ru: Если имеются снимки данных, ``box.cfg`` начнет процесс восстановления. После этого ход действий аналогичен ``BootstrappingBox``.

source: This state can be caused by the following events:
ru: Это состояние может быть вызвано следующими событиями:

source: Failed binding to binary port for iproto usage
ru: Не удалось выполнить привязку к двоичному порту для использования iproto;

source: Server is missing in cluster-wide config
ru: В конфигурации на уровне кластера отсутствует сервер;

source: Replicaset is missing in cluster-wide config
ru: В конфигурации на уровне кластера отсутствует набор реплик;

source: Failed replication configuration
ru: Не удалось настроить репликацию.

source: During this state, a configuration of servers and replicasets is being performed. Eventually, cluster topology, which is described in the config, is implemented. But in case of an error instance, the state moves to ``BootError``. Otherwise, it proceeds to configuring roles.
ru: Во время этого состояния выполняется конфигурация серверов и наборов реплик. В конечном итоге реализуется топология кластера, описанная в его конфигурации. В случае возникновения ошибки состояние изменяется на ``BootError``. Если ошибок не возникло, экземпляр переходит к конфигурированию ролей.

source: This state follows the successful configuration of replicasets and cluster topology. The next step is a role configuration.
ru: Это состояние следует сразу за успешной конфигурацией наборов реплик и топологии кластера. Следующим шагом будет конфигурация ролей.

source: The state of role configuration. Instance enters this state while initial setup, after failover trigger(``failover.lua``) or after altering cluster-wide config(``twophase.lua``).
ru: Состояние конфигурации ролей. Экземпляр попадает в это состояние при начальной настройке, при запуске восстановления после сбоя (``failover.lua``) или при изменении конфигурации на уровне кластера (``twophase.lua``).

source: Successful role configuration.
ru: Роли были успешно сконфигурированы.

source: Error during role configuration.
ru: Ошибка при конфигурировании ролей.
