Repository: tarantool/cartridge
Catalog: rst/locale/*/LC_MESSAGES/troubleshooting.po
Languages: ru

source: Troubleshooting
ru: Руководство по разрешению проблем

source: First of all, see a similar `guide <https://www.tarantool.io/en/doc/latest/book/admin/troubleshoot/>`_ in the Tarantool manual. Below you can find other Cartridge-specific problems considered.
ru: Для начала обратитесь к аналогичному `руководству по разрешению проблем <https://www.tarantool.io/en/doc/latest/book/admin/troubleshoot/>`_ в документации Tarantool. Ниже рассматриваются проблемы, присущие Tarantool Cartridge.

source: Contents
ru: Содержание

source: Problems with replica
ru: Проблемы, связанные с репликами

source: **Examples:**
ru: **Примеры:**

source: **Solution:**
ru: **Решение:**

source: If you have some replication conflicts and issues that you don't know how to deal with, try to rebootstrap the replica.
ru: Если вы не знаете, как справиться с возникшими конфликтами и проблемами репликации, попробуйте повторно настроить реплику.

source: **(!)** Make sure that you have your data safe on the master before rebootstrap.
ru: **(!)** Перед повторной настройкой убедитесь, что ваши данные находятся в безопасности на мастере.

source: Stop the instance
ru: Остановите экземпляр

source: Delete snapshots and xlogs
ru: Удалите снимки и файлы в формате xlog

source: Preserve cluster-wide config (``config`` dir)
ru: Сохраните конфигурацию на уровне кластера (каталог ``config``)

source: Restart the instance
ru: Перезапустите экземпляр

source: Editing clusterwide configuration in WebUI returns an error
ru: При редактировании конфигурации на уровне кластера в веб-интерфейсе возникает ошибка

source: **Examples**:
ru: **Примеры**:

source: **The root problem**: all cluster instances are equal, and all of them store a copy of clusterwide configuration, which must be the same. If an instance degrades (can't accept new configuration) -- the quorum is lost. This prevents further configuration modifications to avoid inconsistency.
ru: **Главная проблема**: все экземпляры кластера равны, и все они хранят копию конфигурации на уровне кластера, которая должна быть одинаковой. Если один из экземпляров дает сбой (не может принять новую конфигурацию), то кворум потерян. Чтобы избежать несогласованности, дальнейшие изменения конфигурации не допускаются.

source: But sometimes inconsistency is needed to repair the system, at least partially and temporarily. It can be achieved by disabling degraded instances.
ru: Тем не менее, иногда несогласованность необходима для восстановления системы, хотя бы частично и временно. Этого можно достичь, отключив экземпляр, который дал сбой.

source: **Solution**:
ru: **Решение**:

source: Connect to the console of the alive instance.
ru: Подключитесь к консоли рабочего экземпляра.

source: Inspect what's going on.
ru: Проверьте, что происходит.

source: If you're ready to proceed, run the following snippet. It'll disable all instances which are not healthy. After that, you can use the WebUI as usual.
ru: Если вы готовы продолжить, запустите следующий фрагмент кода. Он отключит все нерабочие экземпляры. После этого вы сможете использовать веб-интерфейс как обычно.

source: When it's necessary to bring disabled instances back, re-enable them in a similar manner:
ru: Если необходимо вернуть отключенные экземпляры, включите их:

source: An instance is stuck in the ConnectingFullmesh state upon restart
ru: Экземпляр зависает в состоянии ConnectingFullmesh после перезапуска

source: **Example**:
ru: **Пример**:

source: **The root problem**: after restart, the instance tries to connect to all its replicas and remains in the ``ConnectingFullmesh`` state until it succeeds. If it can't (due to replica URI unavailability or for any other reason) -- it's stuck forever.
ru: **Главная проблема**: после перезапуска экземпляр пытается подключиться ко всем своим репликам и остается в состоянии ``ConnectingFullmesh`` до тех пор, пока ему это не удастся. Если он не может (из-за недоступности URI реплики или по любой другой причине), то он завис навсегда.

source: Set the `replication_connect_quorum <https://www.tarantool.io/en/doc/latest/reference/configuration/#cfg-replication-replication-connect-quorum>`_ option to zero. It may be accomplished in two ways:
ru: Для параметра `replication_connect_quorum <https://www.tarantool.io/en/doc/latest/reference/configuration/#cfg-replication-replication-connect-quorum>`_ задайте значение "ноль". Это может сделать двумя способами:

source: By restarting it with the corresponding option set (in environment variables or in the :ref:`instance configuration file <cartridge-run-systemctl-config>`);
ru: Перезапустить экземпляр, задав соответствующий параметр (в переменных окружения или в :ref:`конфигурационном файле экземпляра <cartridge-run-systemctl-config>`);

source: Or without restart -- by running the following one-liner:
ru: Без перезапуска выполнить:

source: I want to run an instance with a new advertise_uri
ru: Я хочу запустить экземпляр с новым advertise_uri

source: **The root problem**: ``advertise_uri`` parameter is persisted in the clusterwide configuration. Even if it changes upon restart, the rest of the cluster keeps using the old one, and the cluster may behave in an odd way.
ru: **Главная проблема**: Параметр ``advertise_uri`` сохраняется в конфигурации на уровне кластера. Даже если изменить его при перезапуске, остальная часть кластера продолжит использовать старое значение, и кластер может вести себя непредсказуемо.

source: The clusterwide configuration should be updated.
ru: Нужно обновить конфигурацию на уровне кластера.

source: Make sure all instances are running and not stuck in the ConnectingFullmesh state (see :ref:`above <troubleshooting-stuck-connecting-fullmesh>`).
ru: Убедитесь, что все экземпляры запущены и не зависли в состоянии ConnectingFullmesh (см. :ref:`проблему выше <troubleshooting-stuck-connecting-fullmesh>`).

source: Make sure all instances have discovered each other (i.e. they look healthy in the WebUI).
ru: Убедитесь, что все экземпляры нашли друг друга (т.е. в веб-интерфейсе выглядят рабочими).

source: Run the following snippet in the Tarantool console. It'll prepare a patch for the clusterwide configuration.
ru: Выполните следующий фрагмент кода в консоли Tarantool. Он подготовит патч для конфигурации на уровне кластера.

source: As a result you'll see a brief summary like the following one:
ru: В результате вы увидите сводную таблицу такого типа:

source: Finally, apply the patch:
ru: Наконец, примените патч:

source: The cluster is doomed, I've edited the config manually. How do I reload it?
ru: Кластер уже не спасти, я отредактировал конфигурацию вручную. Как мне ее перезагрузить?

source: Please be aware that it's quite risky and you know what you're doing. There's some useful information about :ref:`clusterwide configuration <cartridge-config>` anatomy and "normal" management API.
ru: Обратите внимание, что это довольно рискованно (убедитесь, что вы знаете, что делаете). Вам пригодится информация о структуре :ref:`конфигурации на уровне кластера <cartridge-config>` и "нормальном" API управления.

source: But if you're still determined to reload the configuration manually, you can do (in the Tarantool console):
ru: Если вы все же решили перезагрузить конфигурацию вручную, это можно сделать в консоли Tarantool:

source: function reload_clusterwide_config() local changelog = {} local ClusterwideConfig = require('cartridge.clusterwide-config') local confapplier = require('cartridge.confapplier') -- load config from filesystem table.insert(changelog, 'Loading new config...') local cfg, err = ClusterwideConfig.load('./config') if err ~= nil then return changelog, string.format('Failed to load new config: %s', err) end -- check instance state table.insert(changelog, 'Checking instance config state...') local roles_configured_state = 'RolesConfigured' local connecting_fullmesh_state = 'ConnectingFullmesh' local state = confapplier.wish_state(roles_configured_state, 10) if state == connecting_fullmesh_state then return changelog, string.format( 'Failed to reach %s config state. Stuck in %s. ' .. 'Call "box.cfg({replication_connect_quorum = 0})" in instance console and try again', roles_configured_state, state ) end if state ~= roles_configured_state then return changelog, string.format( 'Failed to reach %s config state. Stuck in %s', roles_configured_state, state ) end -- apply config changes table.insert(changelog, 'Applying config changes...') cfg:lock() local ok, err = confapplier.apply_config(cfg) if err ~= nil then return changelog, string.format('Failed to apply new config: %s', err) end table.insert(changelog, 'Cluster-wide configuration was successfully updated') return changelog end reload_clusterwide_config()
ru: function reload_clusterwide_config() local changelog = {} local ClusterwideConfig = require('cartridge.clusterwide-config') local confapplier = require('cartridge.confapplier') -- загрузите конфигурацию из файловой системы table.insert(changelog, 'Loading new config...') local cfg, err = ClusterwideConfig.load('./config') if err ~= nil then return changelog, string.format('Failed to load new config: %s', err) end -- проверьте состояние экземпляра table.insert(changelog, 'Checking instance config state...') local roles_configured_state = 'RolesConfigured' local connecting_fullmesh_state = 'ConnectingFullmesh' local state = confapplier.wish_state(roles_configured_state, 10) if state == connecting_fullmesh_state then return changelog, string.format( 'Failed to reach %s config state. Stuck in %s. ' .. 'Call "box.cfg({replication_connect_quorum = 0})" in instance console and try again', roles_configured_state, state ) end if state ~= roles_configured_state then return changelog, string.format( 'Failed to reach %s config state. Stuck in %s', roles_configured_state, state ) end -- примените изменения конфигурации table.insert(changelog, 'Applying config changes...') cfg:lock() local ok, err = confapplier.apply_config(cfg) if err ~= nil then return changelog, string.format('Failed to apply new config: %s', err) end table.insert(changelog, 'Cluster-wide configuration was successfully updated') return changelog end reload_clusterwide_config()

source: This snippet reloads the configuration on a single instance. All other instances continue operating as before.
ru: Этот фрагмент кода перезагрузит конфигурацию на отдельном экземпляре. Все остальные экземпляры продолжат работать в прежнем режиме.

source: If further configuration modifications are made with a two-phase commit (e.g. via the WebUI or with the Lua API), the active configuration of an active instance will be spread across the cluster.
ru: Если в дальнейшем изменения в конфигурацию будут внесены по двухфазной фиксации (например, через веб-интерфейс или с помощью Lua API), действующая конфигурация активного экземпляра будет распределена по кластеру.

source: Repairing cluster using Cartridge CLI repair command
ru: Восстановление кластера с помощью команды repair в Cartridge CLI

source: Cartridge CLI has `repair <https://github.com/tarantool/cartridge-cli#repairing-a-cluster>`_ command since version `2.3.0 <https://github.com/tarantool/cartridge-cli/releases/tag/2.3.0>`_.
ru: Начиная с версии `2.3.0 <https://github.com/tarantool/cartridge-cli/releases/tag/2.3.0>`_, в интерфейсе командной строки Cartridge можно использовать команду `repair <https://github.com/tarantool/cartridge-cli#repairing-a-cluster>`_.

source: It can be used to get current topology, remove instance from cluster, change replicaset leader or change instance advertise URI.
ru: Эту команду можно использовать, чтобы получить текущую топологию, удалить экземпляра из кластера, изменить лидера в наборе реплик или изменить URI, который передает экземпляр.

source: ``cartridge repair`` patches the cluster-wide configuration files of application instances placed ON THE LOCAL MACHINE. It means that running ``cartridge repair`` on all machines is user responsibility.
ru: ``cartridge repair`` исправляет кластерные конфигурационные файлы экземпляров приложений, размещенных НА ЛОКАЛЬНОЙ МАШИНЕ. Это означает, что в обязанности пользователя входит запуск ``cartridge repair`` на всех машинах.

source: It's not enough to apply new configuration: the configuration should be reloaded by the instance. If your application uses ``cartridge >= 2.0.0``, you can simply use ``--reload`` flag to reload configuration. Otherwise, you need to restart instances or reload configuration manually.
ru: Недостаточно применить новую конфигурацию — экземпляр должен перезагрузить конфигурацию. Если у вашего приложения ``cartridge >= 2.0.0``, вы можете просто использовать флаг ``--reload``, чтобы загрузить конфигурацию. В противном случае нужно перезапустить экземпляры или перезагрузить конфигурацию вручную.

source: Changing instance advertise URI
ru: Изменение URI, который передает экземпляр

source: To change instance advertise URI you have to perform these actions:
ru: Чтобы изменить advertise_URI экземпляра, нужно выполнить следующие действия:

source: Start instance with a new advertise URI. The easiest way is to change ``advertise_uri`` value in the :ref:`instance configuration file <cartridge-run-systemctl-config>`).
ru: Запустите экземпляр с новым advertise_URI. Самый простой способ — изменить значение ``advertise_uri`` в :ref:`конфигурационном файле экземпляра <cartridge-run-systemctl-config>`).

source: Make sure instances are running and not stuck in the ConnectingFullmesh state (see :ref:`above <troubleshooting-stuck-connecting-fullmesh>`).
ru: Убедитесь, что экземпляры запущены и не зависли в состоянии ConnectingFullmesh (см. :ref:`проблему выше <troubleshooting-stuck-connecting-fullmesh>`).

source: Get instance UUID:
ru: Получите UUID экземпляра:

source: open ``server details`` tab in WebUI;
ru: откройте вкладку ``server details`` в веб-интерфейсе;

source: call ``cartridge repair list-topology --name <app-name>`` and find desired instance UUID:
ru: вызовите ``cartridge repair list-topology --name <app-name>`` и найдите нужный экземпляр:

source: get instance ``box.info().uuid``:
ru: получите ``box.info().uuid`` экземпляра:

source: Now we need to update instance advertise URI in all instances cluster-wide configuration files on each machine. Run ``cartridge repair set-advertise-uri`` with ``--dry-run`` flag on each machine to check cluster-wide config changes computed by ``cartridge-cli``:
ru: Теперь нужно обновить URI, который передает этот экземпляр, в конфигурационных файлах на уровне кластера на каждой машине. Запустите ``cartridge repair set-advertise-uri`` с флагом ``--dry-run`` на каждой машине, чтобы проверить изменения конфигурации на уровне кластера, вычисленные ``cartridge-cli``:

source: Run ``cartridge repair set-advertise-uri`` without ``--dry-run`` flag on each machine to apply config changes computed by ``cartridge-cli``. If your application uses ``cartridge >= 2.0.0``, you can specify ``--reload`` flag to load new cluter-wide configuration on instances. Otherwise, you need to restart instances or reload configuration manually.
ru: Запустите ``cartridge repair set-advertise-uri`` без флага ``--dry-run`` на каждой машине, чтобы применить изменения конфигурации, вычисленные ``cartridge-cli``. Если у вашего приложения ``cartridge >= 2.0.0``, вы можете указать флаг ``--reload``, чтобы загрузить новую кластерную конфигурацию на экземпляры. В противном случае нужно перезапустить экземпляры или перезагрузить конфигурацию вручную.

source: Changing replicaset leader
ru: Изменение лидера в наборе реплик

source: You can change replicaset leader using ``cartridge repair`` command.
ru: Поменять лидера в наборе реплик можно с помощью команды ``cartridge repair``.

source: Get replicaset UUID and new leader UUID (in WebUI or by calling ``cartridge repair list-topology --name <app-name>``).
ru: Получите UUID набора реплик и UUID нового лидера (в веб-интерфейсе или с помощью команды ``cartridge repair list-topology --name <app-name>``).

source: Now we need to update cluster-wide config for all instances on each machine. Run ``cartridge repair set-leader`` with ``--dry-run`` flag on each machine to check cluster-wide config changes computed by `` cartridge-cli``:
ru: Теперь нужно обновить конфигурационные файлы на уровне кластера на каждой машине. Запустите ``cartridge repair set-leader`` с флагом ``--dry-run`` на каждой машине, чтобы проверить изменения конфигурации на уровне кластера, вычисленные ``cartridge-cli``:

source: Removing instance from the cluster
ru: Удаление экземпляра из кластера

source: You can remove instance from cluster using ``cartridge repair`` command.
ru: Удалить экземпляр из кластера можно с помощью команды ``cartridge repair``.

source: Now we need to update cluster-wide config for all instances on each machine. Run ``cartridge repair remove-instance`` with ``--dry-run`` flag on each machine to check cluster-wide config changes computed by ``cartridge-cli``:
ru: Теперь нужно обновить конфигурационные файлы на уровне кластера на каждой машине. Запустите ``cartridge repair remove-instance`` с флагом ``--dry-run`` на каждой машине, чтобы проверить изменения конфигурации на уровне кластера, вычисленные ``cartridge-cli``:

source: Run ``cartridge repair remove-instance`` without ``--dry-run`` flag on each machine to apply config changes computed by ``cartridge-cli``. If your application uses ``cartridge >= 2.0.0``, you can specify ``--reload`` flag to load new cluter-wide configuration on instances. Otherwise, you need to restart instances or reload configuration manually.
ru: Запустите ``cartridge repair remove-instance`` без флага ``--dry-run`` на каждой машине, чтобы применить изменения конфигурации, вычисленные ``cartridge-cli``. Если у вашего приложения ``cartridge >= 2.0.0``, вы можете указать флаг ``--reload``, чтобы загрузить новую кластерную конфигурацию на экземпляры. В противном случае нужно перезапустить экземпляры или перезагрузить конфигурацию вручную.
